#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-fxePaSmpmdbCKLwR

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_instance.composer_internal: Refreshing state... [id=i-0bf72c3a328228c3d]
aws_instance.composer_external: Refreshing state... [id=i-00f4b887d697163a3]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-1013402795]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-2682721396]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-edc8a44d-a2fd-4176-8345-bca82384b54e]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-98ab7cff-5def-4b8e-a971-0137b925d3de]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-00f4b887d697163a3" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-00f4b887d697163a3" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-3-239-112-37.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "3.239.112.37" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R6+Y+cSp7n7yX1/8C4nzS7elNVHJlpp7s9miSBvIqIIiCChNmRxVUJQXAYyAO63/++CrLsrrL96s3srrQaS8giIr7353tEJcuq7JKyu3X6OvkoFEfWZXXQdPdFdknivwhhdSzjoOk/vTM3pq5CDLQF8t7d8LdbkjRtVpUfBelO/NPNn25ub18e+tPNV95a1tZVm3Xj2aDrgigtkrL7i/CUsaQMiuTTu6zMurvo6fDuH1ROE5TtU9Lc6mVUxVl5+Ci8D7PuxYFR5S65dPcRq47xbVSVT9nhTzdmViQ/KPfnl2dubo5t0rQfbwThVuAafBSSSL7lizeCIAhtm34Ojl1aNdmQxJ/zpB/P8n+3wru2TW+bNhAWi8VCVcAQLKU+knX+qi2shbpYLJYLa3mhT8Zmw1ZPy3KeRWzdF26jq42DZfYw63J75UhJ/T5ePg5niXozt0wt9rg36+SxycAF7NnqQ+TC+T0yajUWh7lxBv2v+dMhnT8de+BN5ptfzWAGe4eoh2kKKuPyhParabbuonvbYmWoG9mutvMJy+pqYvmd2hWHxZdDbi9m2pD2h3B2nJrz7OJsLhNXpUfbFFd7awC0Tp76zD3+2m7Qr6mMGyvfLdTjceNZYUPZr0ZKiuDh1Jx6B8rHFnan0lNpGj6ee/hedh9pUO/i+3nqBF8edels9DNsyOU+mjwezuIhs8JZm4WGM7wHTnJxlak1//CltqBreruoPvgNs4P1eufbZtoN8L0Z+w18MPC+sqVFsugnh7SLQANVh4VT+/T4XhkG8YuKDDlawgkUz/X0fP7ymJ7OctmFSu08PHZx0m1/JVPReizrct/bdunX8mCco0SWwv1l9r5M56xMHxr/QJP3UWWVjwvjch8xZabb2/6QHR8j9fxrLn3wjswz9/hLoHb5efuQI6rV1NnLydTcSrNKe99u19Hk3p3m/dPDKTZbksZfpOV+vSIE1kN1CMX5lHiZiPZGXfroXkrIYXmPfnVJ33lP3gexeSIwiheVvPKfyu108BDeb7dz08+D8nJR9PcYZrm+BfMWU1kUh9my78XN0+aLE24ldfr0/ilWggg1DxMt8nBsbO4ltQfuzJDo+8jPFiu43YFw2Buio3RPHy5iIlmfPglFQKvm35okToPuLqqKd6/xnsTydCrNR8wvr5hnvraRgKNP+drmUZWowSb1zHDU7LJ2ZmeYz/YfSnrvv0+qR2Dp96Z43k0+THdCFR7jIHsl7ObcZF3ymVeE57Ssgy79KNx3RX1N78+8Rnw+BU07ahZdq8BH4e/PikJbxZsH7fMSmubG+fRBiYKnD6KYTOWpPAkn0uTp/dM0fJoGiRgr0VySow9zaS4/Uy+h+QhtHX0ln4dyPJ1Np5Pp+6msKB/eT6RQSeQgCZ4+vFdm7xNZCT7I8eR74YvPSx05nx5ssXuwpSXC8dbJVA2RLbaxv7VEA6NxT+yWubS1MdKJDjTL9fe+aCg23qq+yAjWgGXK3gCIusL5VAplX0wKc+pouYxWKQ5lpMYiQi6uH0Kp3gZrnzq5gRA+7yxmqLHof0GEACtna8sxCMKGEouXzBSntW/EbSTVGtj7NHSBYq9S6uTSF2sfPxKdzByC/ARLOnHAPlgB6OxrNT7XfG/yai839g7ZolgkpYuRi4mhI90Q48LsbWqkREkbZyVOE1LPLBGoWGQKMgzfzruTm7MqLgBcjjpvlxgbui/HBtYNfTzrzjX+buUGsEq1cYnh2QSY3pA+uG4NMGFlUqoIYqCa0vbBLOIN0tSLtzeGmB52HtlSkpsyYObUz9MLwvgS4Atx9Q+KqW1RQskQyHVlKvXFWbM1pqmCmXd6kMHWdDeXiKokIbXjiZfAlCKFkLq3zpUINFR4SjU4ezYJDTAjEvGxpJZWzh6CVazCtdFFrLZNd154LuqTNbGdZTeEua/bbjcxlajxBmPnE3I0C9CaRlwvGRFdbbtGkq8hFgNHNk5+jhrXIBoqyYO9jnfYjVfOGg22DgLXBUXMYtc26gDkk0ksxmeTGYHrbKbekErhXv1iksUO637r6ubEXxmBo0upa7AMOSqw98g1dbCxS1VBIjt7JTuGhOFw2Q2oJHKooRNZSX2yrk7JPp1FOpJJLj1GubENrXoSyq0SMdKRNcnRihhY2i4dOVZN3EkelmyyJqm9V1E4bPNQ8S+7YXFBhTdYeNITDNRYJKrlGpDo0grt4w0mTF8y3zb1+dJizEB5pfiO75lKfvZX8zay5zuP+bWXszqW0RFLiwbk0hLqsWoSktv7GLlYWnrYWNk0ZoAdhsRR81A+736HVv1Ki/axYWVzBWMfWFhaWq43+XleXb5h1DrUKiprGciM2WI0DY36Ico3veNKQaAbF1tnZuJeUkdhbuREChrY0iFbjEpwdkssmuuNgiSkeCKq4uIgIQxOtmFky+LSxI7qATz3fBHJ7hoso9V8Za+3sql3j7Z7cYBEdubeO4NVe7IZK9111ISrGpO1eYL7+hzS1CbFpYvW+IRE6dFx8A672zVedjCgJIgGUiDR3wf6RHGcjYTdjkBtuwvXKbNzo8X7dGPJFw2vyATnAHiOMQX7hUJW0xJq6oPNYjEhqgWtWsRyDKxyoQBCbN/9IAKMJ1ive7tcDMGanYCxnUCyRUju+sQFtr2PCytP5UBJgV34x0g2Fdeey8BlEqJpl+jSbEmB6OXVdCfWU4QNyV5XFy+PpQgDb6cYO0wQjpdzFA5eH+fx3sP5FEv+g8fMiUdS0xq2EJQGDdztJaJ44lOk27m1s0vQOvYHJVqDaUSNE9gj0cu3R8Byydqb82V2rckIT/WNDgzM0BblTLMIMq61XNz90Cl4obdk0scrVgQuSOMVni2zxWGzVHVvj1J4qA6b5eL6GD6LSlCH8mS20czDTlMnZpbvvu0vVcffb2vPPR+cknReQfpX9NdHNrVqAp1q4g3V2RxqBpy6AEOdg6ESoVbn3lBdzKGSfK0aPKc6e7SagvG9zn2nTn2nugBaXaBTZ+CVfqD25Wkar0nv26oaruJTVDAxWImzzRpUnrORAIvreJXaWDSMsAB9slfFwJ0frzZfH3sPhtglPcxUzaHSKZK3UuBe8odi3vvnV/5IwxXLgz2avqQfH316ipfq0nf9U1Tg2Uav0zBbXEz+aFUPnKqHy0VvapvLRo8BWXzvJxWGinWwXF/095sDzNSd504OprPgz8ykeGbSw8Gki8G01bVDrFdxiN3tF98FIsxUFrpGHepG7q+3LFLMeaiALHZZ669IH4lq77uo8vbW0ZPn3Us7sEKyoCA0XqpW7G7bwDUPtkymG50d/eLD7AebDVXyikvt9eqDv88PlnspQ2XL/d3BTO0j+fd9/kJ3G4v6Aa9JFq4YfcAdS5zqsNM2Z6AdDl7BxJ31A6bGx3HneexepGiodj/bf37OplYXgNa5r9WUxwI6dQoc3hirKdQqyaSVCGjFLxEMOjU1acVjNpj0Lb4qA5TzraZjfGkl+lpd+E6lmE41eEMle7TOgFMNHPO+w/lXkufU1Hfe1Hfqc71GPnXmOVXvDZXCc8WklczpTa26cL2fefHcOo96v82397VKBkOlmFpNOV+f+2CoM74GtLrwuF+4HbQuTK0SPVrJplNJb/NVC88Z9ZF9bcxT7osechm0Grh+/ugfrl+dcT09Z8xz0dfe1JfzEk2nLsyBN9e6MGmdcz35GtCq3qO8NvAaUU09p2Y8zrye/EHcUm/gPKoBOlznuvCGsTbJQBv9yzxaTcxhtEPxnGtMfTr6+S19xbE+DRxPNTOH6uLz+Fwxd+Z6+7SS4NWvvemMNUHyneoM3savwrHpDaNdZ6hx3nXh0RFnl2ceU9Phsa1TjhuOM5/j+U2+KjO1Sn7OhYmv1SnQagaGauJffTP1Kcdfzbxh5CWbHM+U2/W2H641vGZcb+5HHm//ml9cvwl4rvNAqyRAqwm3AdDR/2/xHTFjjr6oLtwfPq1Tc5QzxlDktnscM3ydn3WqM8+lP+A7+ov7E2ocn6N9innNwTOPD9SqCceyOe6NeBiAVqfe23ETfYfnaNWblOfCiI0J1Pj7KGv0NeS45jHlfuF5R6vLH8StgCNOee2qM2/guK8GXoM4jkfcjdi45viYMxxvPC/ezuMMXPO+H3XRrvEDtDqbTp2aY22rc56LHh179pnnh6n9UX1YDFAba+SE54HH65V2nQGgxuM44vg84s2pJHjt/7xGpf6bebzg9S8D55/3BrRPz6E8ZWFpzTaaJwHHVDbLwznR9LOpLS6veopxkEyNyWavsmSNWDjOPNPhx1lG9YCzmMbUPFiFMfD+aMnzY6Sg3nPZMV6bs80K9MEe1Z5stL/T7zTLqVcWvjjoh772D/4vevHYW22X64Vqv2AsotXh57wXMtBqFY31uF4hp9aRUy9Np9Y55pBWG7xv8HXLqZfw2puWHD+A6+RUMqK1gWitmk6tobfs3xMxWM25rdON3rHEVrf+ihyvcyWfpRY/j92qY4nLckiZAXNkwBxPIY11mHs9zK0LzJEK6UaCubEc1yhZQoplSDcyzM0JpOkS0oUCqadAak1g7q9gvlV/x9d6sN9Cz5UYzOZvz3YvnkgmfeAaLaRgBWk0wJzLileQxgakaAWpLkGqD5D6Bsz1C8z95XhuPGv1MPd1mOMJpFxfPFzPWOflG/4c5yyDDJ4bM5ipdJxjXZCGP8yJz/hesTLYozRcqk7gxkdvj6SowO1zLPjcVUerlEWFxHPgh1i4Gj7DvTdsdDKJV+Tor0j+TEsi2Sh95/cwpmLHMA9EJtnGACwqfRZlqhrvUeW7U/F6p2Cn8A1bX2BbDdeIRcWU08i+rT7H6newoyOIh5qGsnQOFcCibPo6nv35gPSpA0sgcj8+FOAU7tUTj+dDMR+8ktThyjqGyrZ8WKq6w8yZt4+Ht849341e+vj7OXcIVnoPHH8f7FGFGVCRO6VRyc4/+kFN4Zhr1dTkdyE69jE6zjbXGY73CN4HL1/nSF53+bzA+/Q49zjjTPnKP55szuBqM/OpPgPDYgZkPPOdxcx39Zlf4BlYbWamk89Mms98TZ95Dp75mjfzCn1maoeZv8Iz6Fiv5/sVYZAeOH57WGxTWPgUUrWA9DCFdMHzMoc0P1/PkAIW2xxSbwILksIC95Dy89F390GV96Ap7x3jXY/Ph7xvcZs0PiuNs8zYv/mcCK6zw9Tn/UKrep/Po3Scb17ZD11z5lNrBhxz5g3WzHMOoy/Mwpv5Lp6ZA7cTzzwZzyB/d/QZ1PDM1KKZN0Tjmk8Xr+3XFiKkaQ4LU4SFUcDCEiHVZVhYE0g3A6RqDgsswsK7QLqZQBrJkB4GSHURUk8e6ah1+a6HTPns6WvjvZfPD8N4/3XGdz538p5Owdiz6/TavyuZ3409Wp19ftcY6gx+N8+YDp4B6s2gY84A98NoI7eLx92agWEz82Ru82YGnGgGNI6Vw8xzvJk3+o3b730Xf4PCwsgg9aZjDaP5FNJtAQt8hoV+htQTId1wWwdIDxIs9B5SfIEUFZAuJuN+oUvfxx9odWZe59TLOCvzd8p7/+gHxbz+LUA0n3OAz3jcXyMutHGu5HPNa/w70cwcFjOT2yfjmelaM5Nje8XvzNHMo97ML/TRDybPFc0a8Q4Gjpt8BgqOkc138T/IkMYUUiODBWKQRiKkBoOFOUBqniEFGSw8+doHoh7STQ8px8xGglSlkDI20r6OP7/H8Dym5jDOQ9KIB2fM+QkY6vz5PiqN91OeA9zuoc7G+X5c4zP7a/t5jvuFNwMra+Zr1gxo5mibyfOgwDOPbmZmwdf1Mfa8XvjaYsQHcDYz3/lZ/oMU0mh6xfTi/PWPTVZO1jaeHCyR2ERnKxsDleh43HuwamBjpidurVmi0dtyrMYiW1puvCWEbUMsqTvpMJiO+sUT8cXUfA24KDcVXSRinLn7WMeE7Wx5HthuKnviVMWYmMt8i6x9vApyQhy83SJRvxBM1FiJTY8CGLhoH65BYA1E9mSJxmJaeeIUBDlRHIKMBEvY2jNI9Fwk8vjDwQztox3fi8WXe7UaYsnB+3jrS9/p4XZLVKTuyx8KXJbuEmZs7OISIDmtfN2UggPHs6r4cmwEWFJNPdawYqyxyDJTRAjhrYoJUS0Hba0cKdY+Ln2RPFjufGvlBkLaZvBE4xwZxHEJaVxnI3siQ8tckjy6bSyphg/y1IArXSH7SglYnSbloncLkIUKyE29vsTitvL29SkQawUPxtETpVNMNoqvLZqI1BbUiRgYpAilfOexrR/iDkR99wXL22XsghNgyHbzzcQc4qlJ1I2ptzKQSRdjSzTXxizR53tzSL8gaXsBFIHQJTKw5zVxxYHsCfCteuaJhvEwGJWjM4cUZGlK+cRcxV+CrB0Q8b1I948RSQM/nzRWqZ5dZ9sAxxKBO1GiEkAzb3t71Z0cjXxx9oaVFMZ5WaR6KBI3lPy9m6OzJanLpPBPsbuZYCkVLXlOEJ62tlFnPr40vgt2gTjX7D2Y2GtPNNdbA7jGNlLwEGCwAxoWwzLaAYNlCfZOwdronHVdOhhMkX4YbL3bxgYrzdU2i0Xmk5UEfTEuHxQEwQBUt4wJWTHki8bFdkjhy4BiV2JEMsT4XPfmXh8sNwZWbqhIrkufpoov+0osInX88Ymq2CLG5kHcqvY+VpFu5FYRQ5KnCOhk5UsGcfNWdO25CMrDOaTgtGSpGDkEAFG/7GTxFBdzCtcxwYTphG3OQb41QiV2bGyQsLSUaOUXjrHpAxL3cHURiVgPAb4szQJtH4b4EujxBZN85+Ctn+i+bhGw9MWpa+UGcLDZw33th8w/e3mMYncz2MW0DAz95PXz/EH2G2j4hkn9ajcAmFBVNuX5I8rnlakj1TnXIy/b0CdWbhRQJ0sLS5pVGGosEuXZB62VG0osgtLF7CGW2NJiBrF1Q0H72P1qF863BljH2MaMLFnewz2iaGAzl6VbrpdTsJzIl8HNTSkuQOdjsA7zydklcR7ql84p/czVt7I3bN0EX7of7ZrsfDmtgpU1OHvim5SJnhhNE1Z79p789EfI738YtIhhOPoWWRjxnF5auCtNq25ikdGk9A27tHrsEkp0S7FlY2PuEU3weeLqmwbo834ngUmgLM4eSfexG3/x3csjyBmJys0EaaixpDSwROaBwTgtqS/ZJaCxHlNkoAHirif61AvE7pys2cXXiAZdlkfr6kyc1AmH1HlQCMAkfQyLdI3yzcR38cQiACZ6eyLYF3252qEVwYnebTyMVkjeGpjUM0jAQzxYfSDXfYiljChGbRf1Pu47HOOtG7ptjwuyAntAPAVcLMk7Oxo6R2zrwr0xjQ51SvJ54Cw7zZdqDRd15eHaJuu4ChQ1x0p9wQVCkbJQPBdMnNzYhFknklWnOmt28ZRYDSnKbTkSwxLJ0ZpZNgFkWZincE1AKFUTNOSSqaeDs48fHySGPZltEa5R4pK1OfhVPKCl1887LB56lNcuLoCL1mBPcj/1aXQiK2SjFZgEWbuL5PxiMWNImNGZ+NKGunQGbqxYjrh7/pHccHLrd3pg9en7H11s++HzTvfszwsEPgVN+TE4tx/bJGqSri2CMjgkzcdje5sEbXcrfZwryvupLM3fz+fz51Mfs7JLmjJgn6OqqKs2acbPe27b6tRM8mdxNlbtJdo8OhsIPpsLsFg9fxmwANr/mdT2GLZRk9VdVpW3zyS3UVUUQRnf5pbHqvlX2Z7t6ObnNbQdsDD1T20XHLLycJtcrnrfftX7Lji3d99eqjY8Ziy+q5rD9z7TNujTfdJF989nvnH4KlFfIt2xvxmqA+0RboDzGaOHT2nX1e3H+/vX1t59s/YuKIKhKp91uX/56cbPRP6wcNdVBfv5Fx3/nlc0+4/nl4Cx6pzEn+OqCLKyFT4J/y6865KgeGn5u38R3qXH8C5skvP36+eqyZPmxy3hq4QoED4J736udRTcRk13VyfFu5uv2l0Z/pf1+3+mx+9/cPdf+XTuctumCWNXcP7et3P/dB9m5X0YtOlNm3TCbXK8VEKd1clTkLGbtjo2UfLzT3Vu/izYSSd0aSK0fdslhZBWbVcGRXJ3c12IOia0SXf7dV345bsM+G9jKEoOWdslzWhtVrZdUEaJcM66VEBrcHdzf2ybe1ZFARulBOdWeJ1VwiHpbq9Lt6eAHRPhf/F8+rqUxcIvf3urNPGi+Jvwd4F+EW4b4d2dPdLZXZOVh3fCv14Vf1mJPj8L/vxcie5oW5U3X8nfOvnuP8lM+LswerMphNun/6wC/10CriU1q/ox3M+ZKiwXQpQ0XfaURUGX3N2EQZvMJsJtLNwKf/3rX4Vf/vbdp2K/Cf8q/PK3l7X6txdZ/p2Ur3Xgj2S8+kbhpxKeGf2RnDzp/y9wm5RxXWVld3tsGIfuG33mt59A/adN/w/x/aqtvwb0y613v3f6ithvDn3Dd9w53HcvsP0T4f9/wKyr9mfbgWix0j/dx8npvjwViVRKN7azcPTrSHAKmnuWhT+OBc9F+1gLbVc1wSERqvIbJu5usifhn4RDk9Q8pl/Z/Sbc100V3RfVsezav3AYlTeC8GdBL9tjkwi6agtZKzwdGet5qy+TqEti4Slr2u7uRhCeqkZwNqaOhKwU/ibe3Smi+NtfhLgau2L2JLRd0Am/vLDrmwz+L2yS4Dq9PWXXT7hZktSCdCMIcVUmN6MqyzSJcs5rb9jjx+fPLSlrhYA1SRD3QhHECVdntPHy1H7Oyqfq98QW+VN7d3lqX+3fjCqM8swg/1YZvnl3NCQR4qxJoq5qei6qyNo2Kw9ccJHHWSPcvvbtld0ijoWuus5VT20XhEJQxsLocE6ZRGklvPvlby90+e11hLiqcfIUHFnXCqIgvhP+LnRJItwGL5hyHTjL10aNCqCE10hbf8jK4+U6r126lstuEo6UJKpK4RadhK/QupJxLL3wdp00o71VOZJGaXXmVMLn7z318YeVnziFJE32xKtW8DxlPCM2a4Vzk3VByJIbQeiqY5S+or6/q5vqlHE1svLwOeLQ4IaMufyHB5+y/zZNahHTY9v9o6R3lcD4mFLypA6Esipv+aQSB00s1FXTXV2ZtQJL2lZgWZ6wnhOFyc2fhTYKyjKJR+DVTRUm8d3NnwUHavB/FGnQx0n5Pz8KbiKUCT8URZwFx0aTRbzdt1wmj1KZdHwOFlhySpgQdEJbFZz/2C7+RQiPnXBOeOb+cyekwSkRsk5oskPaCWV1vrv5liQjbK+4ip///6Gc3QZ1dtdWUZ50d/H9DQf8f52sOiVNk8XJXVSVT7zVjDX1yJjw178KOjRu/t0ej/7HzcPoXLtrkqD49Ppt/uH97IYf/sfkGwdJUZW3TcKqIObhemySOmh+LBv/zB1ZVF0iXC8QQps0pyxK2jEWVz3blzN1EbT5Ny5Xmn+T7p6pXpxLSp4jwu1tWZ2/nb+KeiZ79sIf0fzEcT8kye3tn27+dwAAAP//DgJH23M0AAA=" -> "H4sIAAAAAAAA/9R6+W+kSp7n75b6f2CqnzS7emObIzOrsrprNEkCeZkIExBBwuyoxOWEIDgKyAO63/++CtJVY1fV85vZXWnVlpBNEN/78z3CsKzKLim7W6evk49CcWRdVgdNd19klyT+ixBWxzIOmv7TO3Nj6irEQFsg790Nv7slSdNmVflRkO7EP9386eb29uWmP9185a1lbV21WTfuDbouiNIiKbu/CE8ZS8qgSD69y8qsu4ueDu/+k8ppgrJ9SppbvYyqOCsPH4X3Yda92DCq3CWX7j5i1TG+jaryKTv86cbMiuQH5f78cs/NzbFNmvbjjSDcClyDj0ISybd88UYQBKFt08/BsUurJhuS+HOe9ONe/nMrvGvb9LZpA2GxWCxUBQzBUuojWee32sJaqIvFYrmwlhf6ZGw2bPW0LOdZxNZ94Ta62jhYZg+zLrdXjpTU7+Pl43CWqDdzy9Rij3uzTh6bDFzAnq0+RC6c3yOjVmNxmBtn0P+aPx3S+dOxB95kvvnVDGawd4h6mKagMi5PaL+aZusuurctVoa6ke1qO5+wrK4mlt+pXXFYfDnk9mKmDWl/CGfHqTnPLs7mMnFVerRNcbW3BkDr5KnP3OOv7Qb9msq4sfLdQj0eN54VNpT9aqSkCB5Ozal3oHxsYXcqPZWm4eO5h+9l95EG9S6+n6dO8OVRl85GP8OGXO6jyePhLB4yK5y1WWg4w3vgJBdXmVrzD19qC7qmt4vqg98wO1ivd75tpt0A35ux38AHA+8rW1oki35ySLsINFB1WDi1T4/vlWEQv6jIkKMlnEDxXE/P5y+P6eksl12o1M7DYxcn3fZXMhWtx7Iu971tl34tD8Y5SmQp3F9m78t0zsr0ofEPNHkfVVb5uDAu9xFTZrq97Q/Z8TFSz7/m0gfvyDxzj78Eapeftw85olpNnb2cTM2tNKu09+12HU3u3WnePz2cYrMlafxFWu7XK0JgPVSHUJxPiZeJaG/UpY/upYQclvfoV5f0nffkfRCbJwKjeFHJK/+p3E4HD+H9djs3/TwoLxdFf49hlutbMG8xlUVxmC37Xtw8bb444VZSp0/vn2IliFDzMNEiD8fG5l5Se+DODIm+j/xssYLbHQiHvSE6Svf04SImkvXpk1AEtGr+rUniNOjuoqp49xrvSSxPp9J8xPzyinnmaxsJOPqUr20eVYkabFLPDEfNLmtndob5bP+hpPf++6R6BJZ+b4rn3eTDdCdU4TEOslfCbs5N1iWfeUV4Tss66NKPwn1X1Nf0/sxrxOdT0LSjZtG1CnwU/v6sKLRVvHnQPi+haW6cTx+UKHj6IIrJVJ7Kk3AiTZ7eP03Dp2mQiLESzSU5+jCX5vIz9RKaj9DW0VfyeSjH09l0Opm+n8qK8uH9RAqVRA6S4OnDe2X2PpGV4IMcT74Xvvi81JHz6cEWuwdbWiIcb51M1RDZYhv7W0s0MBqfid0yl7Y2RjrRgWa5/t4XDcXGW9UXGcEasEzZGwBRVzifSqHsi0lhTh0tl9EqxaGM1FhEyMX1QyjV22DtUyc3EMLnncUMNRb9L4gQYOVsbTkGQdhQYvGSmeK09o24jaRaA3ufhi5Q7FVKnVz6Yu3jR6KTmUOQn2BJJw7YBysAnX2txueaP5u8epYbe4dsUSyS0sXIxcTQkW6IcWH2NjVSoqSNsxKnCalnlghULDIFGYZv593JzVkVFwAuR523S4wN3ZdjA+uGPu515xq/t3IDWKXauMTwbAJMb0gfXLcGmLAyKVUEMVBNaftgFvEGaerF2xtDTA87j2wpyU0ZMHPq5+kFYXwJ8IW4+gfF1LYooWQI5LoylfrirNka01TBzDs9yGBruptLRFWSkNrxxEtgSpFCSN1b50oEGio8pRqcPZuEBpgRifhYUksrZw/BKlbh2ugiVtumOy88F/XJmtjOshvC3Ndtt5uYStR4g7HzCTmaBWhNI66XjIiutl0jydcQi4EjGyc/R41rEA2V5MFexzvsxitnjQZbB4HrgiJmsWsbdQDyySQW47PJjMB1NlNvSKVwr34xyWKHdb91dXPir4zA0aXUNViGHBXYe+SaOtjYpaogkZ29kh1DwnC47AZUEjnU0ImspD5ZV6dkn84iHckklx6j3NiGVj0J5VaJGOnImuRoRQwsbZeOHKsm7iQPSzZZk9Teqygctnmo+JfdsLigwhssPOkJBmosEtVyDUh0aYX28QYTpi+Zb5v6fGkxZqC8UnzH90wlP/ureRvZ853H/NrLWR3L6IilRQNyaQn1WDUJye19jFwsLT1srGwaM8AOQ+KoeSifd79Dq36lRfvYsLK5grEPLCwtLdeb/DyvLt8wah1qFZW1DGTGbDGahkb9EOWb3nGlINCNi60zM3EvqaMwN3IiBQ1s6ZAtRiU4uyUWzfVGQRJSPBFVcXGQEAYn2zCyZXFpYkf1AJ57vohkdw2W0Wq+stdb2dS7R9u9OEAiO3PvncGqPdmMle46asJVjcnaPMF9fQ5papPi0kVrfEKi9Og4eIfd7RovOxhQEkQDKZDo7wN9ojjORsJuR6C23YXrlNm50eJ9urHki4ZXZIJzADzHmIL9QiGraQk19cFmsZgQ1YJWLWI5Bla5UAAhtu9+EAHGE6zXvV0uhmDNTsDYTiDZIiR3feIC297HhZWncqCkwC78YySbimvPZeAyCdG0S3RptqRA9PJquhPrKcKGZK+ri5fHUoSBt1OMHSYIx8s5Cgevj/N47+F8iiX/wWPmxCOpaQ1bCEqDBu72ElE88SnS7dza2SVoHfuDEq3BNKLGCeyR6OXbI2C5ZO3N+TK71mSEp/pGBwZmaItyplkEGddaLu5+6BS80Fsy6eMVKwIXpPEKz5bZ4rBZqrq3Ryk8VIfNcnG9DJ9FJahDeTLbaOZhp6kTM8t3354vVcffb2vPPR+cknReQfpX9NdLNrVqAp1q4g3V2RxqBpy6AEOdg6ESoVbn3lBdzKGSfK0aPKc6e7SagvG+zn2nTn2nugBaXaBTZ+CVfqD25Wkar0nv26oaruJTVDAxWImzzRpUnrORAIvreJXaWDSMsAB9slfFwJ0frzZfL3sPhtglPcxUzaHSKZK3UuBe8odi3vvnV/5IwxXLgz2avqQfL316ipfq0nf9U1Tg2Uav0zBbXEx+aVUPnKqHy0VvapvLRo8BWXzvJxWGinWwXF/095sDzNSd504OprPg18ykeGbSw8Gki8G01bVDrFdxiN3tF98FIsxUFrpGHepG7q+3LFLMeaiALHZZ669IH4lq77uo8vbW0ZPn3Us7sEKyoCA0XqpW7G7bwDUPtkymG50d/eLD7AebDVXyikvt9eqDv88PlnspQ2XL/d3BTO0j+fd9/kJ3G4v6Aa9JFq4YfcAdS5zqsNM2Z6AdDl7BxJ31A6bGy3HneexepGiodj97/nydTa0uAK1zX6spjwV06hQ4vDFWU6hVkkkrEdCKHyIYdGpq0orHbDDpW3xVBijnW03H+NJK9LW68J1KMZ1q8IZK9midAacaOOZ9h/OvJM+pqe+8qe/U53qNfOrMc6reGyqF54pJK5nTm1p14Xo/8+K5dR71fptv72uVDIZKMbWacr4+98FQZ3wNaHXhcb9wO2hdmFolerSSTaeS3uarFp4z6iP72pin3Bc95DJoNXD9/NE/XL8643p6zpjnoq+9qS/nJZpOXZgDb651YdI653ryNaBVvUd5beA1opp6Ts14nHk9+YO4pd7AeVQDdLjOdeENY22SgTb6l3m0mpjDaIfiOdeY+nT081v6imN9GjieamYO1cXn8bli7sz19mklwatfe9MZa4LkO9UZvI1fhWPTG0a7zlDjvOvCoyPOLs88pqbDY1unHDccZz7H85t8VWZqlfycCxNfq1Og1QwM1cS/+mbqU46/mnnDyEs2OZ4pt+ttP1xreM243tyPPN7+Nb+4fhPwXOeBVkmAVhNuA6Cj/9/iO2LGHH1RXbg/fFqn5ihnjKHIbfc4Zvg63+tUZ55Lf8B39Bf3J9Q4Pkf7FPOag2ceH6hVE45lc3w24mEAWp16b8dN9B2eo1VvUp4LIzYmUOP3o6zR15DjmseU+4XnHa0ufxC3Ao445bWrzryB474aeA3iOB5xN2LjmuNjznC88bx4O48zcM37ftRFu8YP0OpsOnVqjrWtznkuenTs2WeeH6b2R/VhMUBtrJETngcer1fadQaAGo/jiOPziDenkuC1//Malfpv5vGC178MnH/eG9A+PYfylIWlNdtongQcU9ksD+dE08+mtri86inGQTI1Jpu9ypI1YuE480yHH2cZ1QPOYhpT82AVxsD7oyXPj5GCes9lx3htzjYr0Ad7VHuy0f5Ov9Msp15Z+OKgH/raf/J/0YvH3mq7XC9U+wVjEa0OP+e9kIFWq2isx/UKObWOnHppOrXOMYe02uB9g69bTr2E19605PgBXCenkhGtDURr1XRqDb1l/56IwWrObZ1u9I4ltrr1V+R4nSv5LLX4eexWHUtclkPKDJgjA+Z4Cmmsw9zrYW5dYI5USDcSzI3luEbJElIsQ7qRYW5OIE2XkC4USD0FUmsCc38F8636O77Wg/0Weq7EYDZ/e7Z7cUUy6QPXaCEFK0ijAeZcVryCNDYgRStIdQlSfYDUN2CuX2DuL8d9416rh7mvwxxPIOX64uG6xzov3/DnOGcZZPDcmMFMpeMc64I0/GFOfMb3ipXBHqXhUnUCNz56eyRFBW6fY8HnrjpapSwqJJ4DP8TC1fAZ7r1ho5NJvCJHf0XyZ1oSyUbpO7+HMRU7hnkgMsk2BmBR6bMoU9V4jyrfnYrXMwU7hW/Y+gLbarhGLCqmnEb2bfU5Vr+DHR1BPNQ0lKVzqAAWZdPX8ezPB6RPHVgCkfvxoQCncK+eeDwfivnglaQOV9YxVLblw1LVHWbOvH08vLXv+Wz00sffz7lDsNJ74Pj7YI8qzICK3CmNSnb+0Q9qCsdcq6YmPwvRsY/Rcba5znC8R/A+ePk6R/K6y+cF3qfHuccZZ8pX/vFkcwZXm5lP9RkYFjMg45nvLGa+q8/8As/AajMznXxm0nzma/rMc/DM17yZV+gzUzvM/BWeQcd6Pd+vCIP0wPHbw2KbwsKnkKoFpIcppAuelzmk+fm6hxSw2OaQehNYkBQWuIeU74++Ow+qvAdNee8Yz3p8PuR9i9uk8VlpnGXG/s3nRHCdHaY+7xda1ft8HqXjfPPKfuiaM59aM+CYM2+wZp5zGH1hFt7Md/HMHLideObJeAb5vaPPoIZnphbNvCEa13y6eG2/thAhTXNYmCIsjAIWlgipLsPCmkC6GSBVc1hgERbeBdLNBNJIhvQwQKqLkHrySEety3c9ZMpnT18bz718fhjG868z3vO5k/d0CsaeXafX/l3J/Gzs0ers87PGUGfwu3nGdPAMUG8GHXMGuB9GG7ldPO7WDAybmSdzmzcz4EQzoHGsHGae48280W/cfu+7+BsUFkYGqTcdaxjNp5BuC1jgMyz0M6SeCOmG2zpAepBgofeQ4gukqIB0MRmfF7r0ffyBVmfmdU69jLMyv6e8949+UMzr/wJE8zkH+IzH/TXiQhvnSj7XvMa/E83MYTEzuX0ynpmuNTM5tlf8zBzNPOrN/EIf/WDyXNGsEe9g4LjJZ6DgGNl8F/+DDGlMITUyWCAGaSRCajBYmAOk5hlSkMHCk699IOoh3fSQcsxsJEhVCiljI+3r+PNzDM9jag7jPCSNeHDGnJ+Aoc6fz6PSeD7lOcDtHupsnO/HNT6zv7af57hfeDOwsma+Zs2AZo62mTwPCjzz6GZmFnxdH2PP64WvLUZ8AGcz852f5T9IIY2mV0wvzl//2WTlZG3jycESiU10trIxUImOx2cPVg1szPTErTVLNHpbjtVYZEvLjbeEsG2IJXUnHQbTUb94Ir6Ymq8BF+WmootEjDN3H+uYsJ0tzwPbTWVPnKoYE3OZb5G1j1dBToiDt1sk6heCiRorselRAAMX7cM1CKyByJ4s0VhMK0+cgiAnikOQkWAJW3sGiZ6LRB5fHMzQPtrxZ7H48lmthlhy8D7e+tJ3erjdEhWp+/JFgcvSXcKMjV1cAiSnla+bUnDgeFYVX46NAEuqqccaVow1FllmigghvFUxIarloK2VI8Xax6UvkgfLnW+t3EBI2wyeaJwjgzguIY3rbGRPZGiZS5JHt40l1fBBnhpwpStkXykBq9OkXPRuAbJQAbmp15dY3Fbevj4FYq3gwTh6onSKyUbxtUUTkdqCOhEDgxShlO88tvVD3IGo775gebuMXXACDNluvpmYQzw1ibox9VYGMulibInm2pgl+nxvDukXJG0vgCIQukQG9rwmrjiQPQG+Vc880TAeBqNydOaQgixNKZ+Yq/hLkLUDIr4X6f4xImng55PGKtWz62wb4FgicCdKVAJo5m1vr7qTo5Evzt6wksI4L4tUD0XihpK/d3N0tiR1mRT+KXY3EyyloiXPCcLT1jbqzMeXxnfBLhDnmr0HE3vtieZ6awDX2EYKHgIMdkDDYlhGO2CwLMHeKVgbnbOuSweDKdIPg61329hgpbnaZrHIfLKSoC/G5YOCIBiA6pYxISuGfNG42A4pfBlQ7EqMSIYYn+ve3OuD5cbAyg0VyXXp01TxZV+JRaSOL5+oii1ibB7ErWrvYxXpRm4VMSR5ioBOVr5kEDdvRdeei6A8nEMKTkuWipFDABD1y04WT3Exp3AdE0yYTtjmHORbI1Rix8YGCUtLiVZ+4RibPiBxD1cXkYj1EODL0izQ9mGIL4EeXzDJdw7e+onu6xYBS1+culZuAAebPdzXfsj8s5fHKHY3g11My8DQT14/zx9kv4GGb5jUr3YDgAlVZVOeP6J8Xpk6Up1zPfKyDX1i5UYBdbK0sKRZhaHGIlGefdBauaHEIihdzB5iiS0tZhBbNxS0j92vduF8a4B1jG3MyJLlPdwjigY2c1m65Xo5BcuJfBnc3JTiAnQ+Buswn5xdEuehfumc0s9cfSt7w9ZN8KX70a7JzpfTKlhZg7MnvkmZ6InRNGG1Z+/JT19Cfv9i0CKG4ehbZGHEc3pp4a40rbqJRUaT0jfs0uqxSyjRLcWWjY25RzTB54mrbxqgz/udBCaBsjh7JN3HbvzFdy+PIGckKjcTpKHGktLAEpkHBuO0pL5kl4DGekyRgQaIu57oUy8Qu3OyZhdfIxp0WR6tqzNxUiccUudBIQCT9DEs0jXKNxPfxROLAJjo7YlgX/TlaodWBCd6t/EwWiF5a2BSzyABD/Fg9YFc9yGWMqIYtV3U+7jvcIy3bui2PS7ICuwB8RRwsSTv7GjoHLGtC/fGNDrUKcnngbPsNF+qNVzUlYdrm6zjKlDUHCv1BRcIRcpC8VwwcXJjE2adSFad6qzZxVNiNaQot+VIDEskR2tm2QSQZWGewjUBoVRN0JBLpp4Ozj5+fJAY9mS2RbhGiUvW5uBX8YCWXj/vsHjoUV67uAAuWoM9yf3Up9GJrJCNVmASZO0ukvOLxYwhYUZn4ksb6tIZuLFiOeLu+SW54eTW7/TA6tP3L11s++HzTvfszwsEPgVN+TE4tx/bJGqSri2CMjgkzcdje5sEbXcrfZwryvupLM3fz+fz510fk0uXNGXAPkdVUVdt0oyf99weprp4cJ7F2Vi1l2jz6Gwg+GwuwGL1/GXAAmj/Z1LbY9hGTVZ3WVXePpPcRlVRBGV8m1seq+ZfZXu2o5uf19B2wMLUP7VdcMjKw+1XvW+/6n0XnNu7bzdVGx4zFt9VzeF7n2kb9Ok+6aL75z3fOHyVqC+R7tjfDNWB9gg3wPmM0cOntOvq9uP9/Wtr775ZexcUwVCVz7rcv/x042cif1i466qC/fyLjn/PK5r9x/NNwFh1TuLPcVUEWdkKn4R/F951SVC8tPzdvwjv0mN4FzbJ+fv1c9XkSfPjI+GrhCgQPgnvfq51FNxGTXdXJ8W7m6/aXRn+t/X7f6bH739w99/5dO5y26YJY1dw/t63c/90H2blfRi06U2bdMJtcrxUQp3VyVOQsZu2OjZR8vNPdW7+LNhJJ3RpIrR92yWFkFZtVwZFcnfz9a+oY0KbdLdf74VfvsuBfxhTUXLI2i5pRnuzsu2CMkqEc9alAlqDu5v7Y9vcsyoK2CglOLfC67wSDkl3e126PQXsmAj/i2fU16UsFn7521vFiZfF34S/C/SLcNsI7+7skc7umqw8vBP+9ar4y1r0+Vnw5+dadEfbqrz5Sv7Wznf/RWbC34XRm00h3D79VxX4Rwm4ltSs6sdwP+eqsFwIUdJ02VMWBV1ydxMGbTKbCLexcCv89a9/FX7523cfi/0m/Kvwy99eVuvfXuT5d1K+VoI/kvHqK4WfSnhm9Edy8qT/v8BtUsZ1lZXd7bFhHLpvdJrffgL1n7b9P8T3q8b+GtAvH737vd1XxH5z6Bu+487hvnuB7Z8I//8DZl21P9sORIuV/uk+Tk735alIpFK6sZ2Fo1+HglPQ3LMs/HEweC7bx1pou6oJDolQld8wcXeTPQn/JByapOYx/cruN+G+bqrovqiOZdf+hcOovBGEPwt62R6bRNBVW8ha4enIWM+bfZlEXRILT1nTdnc3gvBUNYKzMXUkZKXwN/HuThHF3/4ixNXYF7Mnoe2CTvjlhV3fZPCfsEmCfPz7Kbt+xM2SpBakG0GIqzK5GVVZpkmUc157wx4/P39uSlkrBKxJgrgXiiBOuDqjjZen9nNWPlW/J7bIn9q7y1P76vnNqMIozwzyb5Xhm3dHQxIhzpok6qqm56KKrG2z8sAFF3mcNcLta99e2S3iWOiq62T11HZBKARlLIwO55RJlFbCu1/+9kKX315HiKsaJ0/BkXWtIAriO+HvQpckwm3wginXgbN8bdSoAEp4jbT1h6w8Xq4T26Vruewm4UhJoqoUbtFJ+AqtKxnH0gtv10kz2luVI2mUVmdOJXz+3lMff1j5iVNI0mRPvGoFz3PGM2KzVjg3WReELLkRhK46Rukr6vu7uqlOGVcjKw+fIw4NbsiYy3+48Sn7h2lSi5ge2+4/S3pXCYyPKSVP6kAoq/KWTypx0MRCXTXd1ZVZK7CkbQWW5QnrOVGY3PxZaKOgLJN4BF7dVGES3938WXCgBv9HkQZ9nJT/86PgJkKZ8E1RxFlwbDRZxNt9y2XyKJVJxydhgSWnhAlBJ7RVwfmP7eJfhPDYCeeEZ+4/d0IanBIh64QmO6SdUFbnu5tvSTLC9oqr+Pn3D+XsNqizu7aK8qS7i+9vOOD/+2TVKWmaLE7uoqp84q1mrKlHxoS//lXQoXHz7/a49T9uHkbn2l2TBMWn13fzD+9nN3zzVSSffOMgKarytklYFcQ8XI9NUgfNj2Xjn7kji6pLhOsRQmiT5pRFSTvG4qpne/eCcxG0+TcuV5p/k+6eqV7sS0qeI8LtbVmdv+2/inome/bCH9H8xHE/JMnt7Z9u/ncAAAD//0WX/6h1NAAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-075b14915a9ffcf91" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0bf72c3a328228c3d" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0bf72c3a328228c3d" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9R6eY+cypbn/yW970D7XalndLuqWDKx0++51UkCuRURxRLB0tOy2CohCBYDucB797uPgiz7Vdm+dbtnRhq1JWQRy4lzfud3lqhkVVd9WvW3ztCkH7nySPu8Cdv+vswvafIXLqqPVRK2w6d3xtbQFIiAurT8dzfs7RanbZfX1UdOuOP/dPOnm9vbl4v+dPNVtpp3Td3l/bQ27Pswzsq06v/CPeU0rcIy/fQur/L+Ln46vPvHLqcNq+4pbW+1Kq6TvDp85N5Hef9iwaRyn176+5jWx+Q2rqun/PCnGyMv0x+U+/PLNTc3xy5tu483HHfLMQ0+cmks3rLBG47juK7LPofHPqvbfEyTz0U6TGvZv1vuXddlt20XcsvlcqlIYAxXwhCLGntVl+ZSWS6Xq6W5upAnfbul66dVtchjuhlKt9WU1kEifZD7wl47Qtq8T1aP41kgvuxWmUkfPaNJH9scXIBH1x9iFy7uLb1REn5c6Gcw/Fo8HbLF03EA/myx/dUIZTg4WDnMM1DrlyfLW8/zTR/f2yatIk3P941dzGje1DMz6JW+PCy/HAp7KatjNhwi+Tg3FvnF2V5mrkKOtsGvPXMEpEmfhtw9/tptrV8zEbVmsV8qx+PWN6OW0F/1DJfhw6k9DQ4Ujx3sT5WvkCx6PA/wveg+krDZJ/eLzAm/PGrCWR9kpIuVF88eD2f+kJuR3OWR7ozvgZNeXGluLj58aUzoGv4+bg5BS+1ws9kHtpH1I3xvJEELH3Tk1bawTJfD7JD1MWih4tBobp8e30vjyH9RLF2MV3AG+XMzP5+/PGans1j1kdQ4D499kva7X/GcNx+rpvIG266CRhz1c5yKQuRd5PdVtqBV9tAGB5K+j2uzelzql/uYSrJm74ZDfnyMlfOvhfDBP1Lf8NCXUOmL8+6hsIjaEMcT07mxE+Rafd/tNvHs3p0Xw9PDKTE6nCVfhJW3WWMMm7E+RPxijv2ctzy9qQLrXkjxYXVv/eriofef/A98+4RhnCxrcR08Vbv56FvI2+0WRlCE1eUiae8RzAttBxYdIiLPj/JqGPjt0/aLE+0EZf70/imRwthqH2Zq7KNE394LygBcWRfI+zjIl2u424No9HTekfqnDxc+FcxPn7gyJHX7b22aZGF/F9flu9d8TxNxPhcWE+dXV87TQN0KwNHmbGz7qAhEp7NG1h0lv2wc+QwL2ftQkfvgfVo/AlO7N/jzfvZhvufq6JiE+avDbs5t3qefWUZ4Dssm7LOP3H1fNtfw/sxyxOdT2HaTZvE1C3zk/v6sKLQVtH1QP6+gYWydTx+kOHz6wPPpXJyLs2gmzJ7eP82jp3mY8okULwQx/rAQFuLz7hU0HqGtWV+3LyIxmcvz+Wz+fi5K0of3MyGSUjFMw6cP7yX5fSpK4QcxmX1/+PLzSrOcTw823z/YwspCyc7JFdXCO2SjYGfyOrKmOb5fFcLORpaGNaCabuAFvC7ZaKcEPMVIBaYh+iPAyhoVcyESAz4tjbmjFqK1zlAkWkrCW5aLmodIaHbhJiBOoVsWOu9NqisJH3yxMAZmQTemo2ML6VLCX3KDnzeBnnSx0KjAC0jkAsleZ8QphC+mlzxiDcsOtoIUCRp2gBeuAXS8RknODZubvZordM/BOyvhceUiy0VY1yxN55PSGGyiZ1jKWmfNz1PcyCYPFMRTydL1wC76k1vQOikBXE0671YI6VogJjrSdG1a6y5U9m4WOjArpXWx7tsYGP6YPbhuAxCmVVopFkRAMYTdg1EmW0tVLr6njwk57H28I7gwRECNeVBkFwuhS4gu2NU+SIa6s1KCx1BsakNqLs6GbhDJJET904MIdoa7vcREwSluHJ+/hIYQSxg3g3mueaBapS/Vo+PRWaQDGQs4QIJSmQV9CNeJAjd6H9PGNtxF6bvWkG6w7az6MSoCzXb7mSHFrT/q+wDjo1GCztCTZkUx76q7jSUEqkUT4Ij6KSis1tWxalX4wd4ke+Qma2djjbYGQtcFZUIT19abEBSzWcInZ4Pqoets5/6YCZGnfDHwco+0oHM1Yxas9dDRhMzVaW45CrA9yzU0sLUrRbJ4evYreowwRdGqH60Ki5FqnfBaGNJNfUq9TI41S8SF8BgX+i4ym1kkdlJMcY83uLDWWEfCbuWIiWKgXvCRYOMNzmxPsaJxV0RScNmPy4tV+qOJZgNGQEl4rJiuDrEmrC0v2SJMtRUNbENbrExKdauopcAJfEMqzsF60cX2Yu/ToPEL2iSidUTCsgWFsIJaohgYF7aXWC4SVj7S1zZJKKCHMXWUIhLP+9/Zq3zda3mJbuYLCaEAmEhYma4/+3lcXb5x1Dw0ilU1IhAptfl4HunNQ1xsB8cVwlDTL7ZGjdS9ZI5E3diJJWukKwfvkFWBs1sh3thsJUuwJJ+36qQ8CBYCJ1vX81V5aRNH8QFa+AFvie4GrOL1Ym1vdqKh9Y+2e3GAgPeG55/BujvZlFbuJm6jdYPwxjhBrzlHJLNxeenjDTpZvPDoOGiP3N0GrXoYEhzGIy4tPvBCbSY5zlZAbo+huttHm4zahd4hL9ua4kVFazxDBQC+o8+Bt5Twel5BVXmwacKnWDGh2fBITIBZLSWAsR24H3iA0AxpzWBXyzHc0BPQdzOId5Yl9kPqAtv2ktIsMjGUMmCXwTEWDcm1FyJwqWCRrE81QV4RwPtFPd/zzdxCumBv6otfJEKMgL+X9D3CFkpWCysa/SEpEs9HxRwJwYNPjZmPM8McdxBUOgnd3SUmaBYQS7MLc29XoHPsD1K8AfOY6CfgWbxf7I6AFoLpGYtVfs3JFpprWw3oiFo7q6CqiS39msv5/Q+VgiV6U8RDsqZl6IIsWSN5lS8P25Wi+Z6VwUN92K6W10cPaFyBJhJn8lY1DntVmRl5sf82v1KcwNs1vns+OBXu/RIPr/ZfH9FQ6xl06pk/1mdjbChwmhKMTQHGmodqU/hjfTHGWgjUevSd+uyTeg6m96YInCYLnPoCSH2BTpODV/qBJhDnWbLBQ2ArSrROTnFJ+XDNy9sNqH1nKwCaNMk6sxGv61EJhtRT+NBdHK82Xx/bA2Pi4gHmiuoQ4RSLOyF0L8VDuRiC8ys8smhNi9Cz5i/3T482PyUrZRW4wSkukbzVmizKlxeDPWo9AKce4Go5GOr2stUSgJff46TASDIPphvwgbc9wFzZ++7sYDhL9sgGQbJBDgeDLEfDVjYONl/5IXF3XwIX8DBXaOTqTaTpRbDZ0VgyFpEE8sSlXbDGQ8wrQ+Bate+ZR19c9C/tQBLOwxKTZKWYibvrQtc42CKebzV6DMoP8g8264rgl5fGH5SHwCsOpnupImnH8O5hrgyx+PuYv9DdRrx2QBucR2tKHlBPU6c+7NXtGaiHg19Sfm/+wKnpcdxFkbgXIR7r/c/mn5+zoTYlIE0RqA1hvoBOkwGHFcZ6DtVaMEjNA1KzSwSFTkMMUjOfjQZ5S65CAWFy6/nkX1LzgdqUgVNLhlOP/liLPmly4NQj43zgMPm14DsNCZw39Z0HTK9JTpP7Tj34Yy2xWDFILbL9hlpfmN7PslhsnSe935Y7BGotgrGWDLUhTG7AMBibnI0BtSl9hguzgzSloda8T2rRcGrhbblK6TuTPmKgTnHKsBggO4PUI9MvmPBh+jU509N3pjjnA/VNfZks3nCa0hhZcW1KgzQF05ONAbUefMJyA8sR9dx3Gsr8zPLJH/gt80cmox6hw3RuSn+ccpMI1Alf6pN6ZoyTHZLvXH0akAnnt/Tlp/w0Mj411BjrS8D8c+XcmekdkFqAV1wHw5lyghA49Rm8zV+JcdMfJ7vOUGWym9InE88uzzLmhsN822SMN4xnAePzm3IVaqi1+BwLs0BtMqA2FIz1LLhiMw8I419D/XGSJRqMz4TZ9TYO1xzeUKY3w5H5O7jGF9NvBp7zPFBrAZB6xmwAZML/LbkTZ4wJi/rC8AhIkxnTOZMPeWa7zzjDxtlapz6zWPoDuRNeDE+oMn5O9knGNQbPzD9QrWeMy8Y0N/FhBGqT+W/7jQ8cFqP1YBAWCxM3ZlBl79NZE9aQ8Zr5lOHC4o7Ulz/wWwknnrLc1eT+yHhfjywHMR5PvJu4cY3xKWYY31hcvB3HObjG/TDpol79B0h9NpwmM6bc1hQsFn0y1ewziw9D/aP8sByhOuXIGYsDn+Ur9doDQJX5ceLxeeKbUwvwWv9ZjsqCN+N4yfJfDs4/rw2Wl50jcU6jypS3qi8Ax5C2q8M5VbWzoS4vr2qKfhAMlYrGoNB0Y9Fo6nnm44+9jOIDZzlPiHEwS31k9dEUF8dYsgbfpcdkY8jbNRhCz2p8Ue9+p96pptOsTXRxrB/q2j/kv6jFU221XaaX1QQlpTGpDz+XvRSB2ijWlI+bteU0muU0K8NpNMY5S210VjfYuOk0K3itTSvGH8B0cmrRIo1ukUYxnEa13rLfw3y4XjBb51utp6mt7II1Pl77StZLLX/uu3VPU5cWkFAdFpYOCzSHJNFg4Q+wMC+wsBRItgIs9NU0RvAKEiRCshVhYcwgyVaQLCVIfAkScwaLYA2LnfI7WGuht4O+K1CYL97u7V48sYiH0NU7SMAakniEBTsrWUOS6JBYa0g0ARJthCTQYaFdYBGspnXTWnOARaDBAs0gYfqi8brGPK/ewHPqs3Q8+m5CYa6QqY91QRb90Cc+83tNq9CzsmilOKGbHH3PEuISdc++YH1XE68zGpcCi4EffOGq6Aw9f9xqeJas8TFY4+J5L45FvQqc3+OYghzdOGAR51sd0LgKaJwrSuJZdeDO+eudgp6iN2x9wW0l2lg0LudsjxjYyrOvfoc7mgXR2JBIFM6RBGicz1/7czgfLG3uwArwDMeHEpwiTzkxfz6Ui9GvcBOtzWMk7aqHlaI51JB9LxnfWvd8N3qJ8fd97hiutQE4gRd6Vo0oUCx3TuKKnn/EQcngFGv13GB3ITLVMTL1NtcejtUIVgcvX/tIlndZv8Dq9NT3OFNP+QofXzRkuN7KAdFkMC5lICI5cJZy4GpyUCIZrLey4RSyQQo5UDXZd5AcqL7sl5psqAc5WCMZOubr/n6NKSQHxt8BlrsMlgGBRCkhOcwhWbK4LCApztc1uITlroDEn8ESZ7BEAyRsffzdfVBhNWjOasd012P9IatbzCaV9UpTLzPVb9YngmvvMA9YvVDrIWD9KJn6m1f2Q9eQA2LKwDFkfzRl3zlMWBilLwcuko2R2YlkX0QyZO+OJkMVyYYay/4YT2MBWb62X13ykGQFLA0elnoJS5OHRBNhac4g2Y6QKAUsEQ9L/wLJdgZJLEJyGCHReEh8cdpHzMt3NWTOes9Ane69rH8Yp/uvM72zvpPVdAKmmt1k1/pdi+xu7JP6HLC7xtjk8Lt+xnCQDIgvQ8eQAcNhspHZxfxuymDcyr7IbN7KwIlloDKuHGTf8WV/wo3Z73/nf53AUs8h8edTDiPFHJJdCUt0hqV2hsTnIdkyW0dIDgIstQESdIHEKiFZzqb5UhO+9z9Qm9y49qmXqVdm74TV/gkHybj+LYA3nmOA9XgMr4kX6tRXsr7mNf+dWDbGpWww+0QkG64pG4zba3ZnjmWf+HJQahMOBosV1Zz4DkbGm0IGJePI9jv/H0RIEgKJnsPSopDEPCQ6haUxQmKcIQE5LH3xWgfiAZLtAAnjzFaARCGQUDrtfe1/do9hcUyMceqHhIkPzhTzMzA2xfN9VJjupywGmN1jk0/9/TTGevbX9rMYD0pfBmtTDlRTBqox2WawOCiR7JOtbJRsXJt8z/JFoC4nfgBnKwfOz+IfZJDE8yunl+evf2wyC7yx0exg8tjGGl3bCChYQ9Pcg9kAG1EtdRvV5PXBFhMl4enKdJMdxnQXIUHZC4fRcJQvPo8uhhqowLUKQ9J4zCe56yUawnRvi4vQdjPR5+cKQthYFTvL9JJ1WGDsoN3O4rULRlhJpMTwCYCha3nRBoTmiEVfFEjCZ7XPz0FYYMnBlp4iAZkehVgreCxOPxzIlhfv2VzCv5xrlAgJDvKSXSB8p4fbr6wyc1/+UODSbJ9SfWuXl9ASszrQDCE8MD4rUiAmeogExdASFUn6BvE0N3jLstBOQRgrpmPtzMKSTC+pAh4/mO5iZxa6Zanb0ef1c6xjx8W4dZ2t6PPUWhWC4JNdawoNfBDnOlxrEvZqKaRNllbLwS1BHkmgMLTmkvC72veaU8g3Ehr1o88LpwRvpUBdtjFuTKhhPtRxGQnF3qe7IEI9iIf+CxJ3q8QFJ0At2y22M2NM5gZWtobWiUDEfYJM3tjocqotPGPMvljC7gKIBSIXi8BeNNjlR+xhEJiN7PO6/jDqtaNRB5d4ZQjFzFgnX8K8Gy0c+LEWHGOchUExa81KObvOrgWOyQN3JsUVgEbRDfa6Pzkq/uJ4upmW+nlVZlrEYzcSAs8trLMpKKu0DE6Ju50hIeNNcYEtNO9svckDdGkDF+xDfqHaHpjZG583NjsduPoultAYIrAHKuKjKt4DneYp8k/hRu+dTVM5CMwt7TDaWr9LdFoZ612e8DTAawEGfFI9SBYEI1DcKsF4Ta2A1y+2g8tABAS5AsWCzifnZjA8bTTdBJiFrlhiUwUkkwIxkBLeUqYfn4iCTKxvH/idYnuJYml6YZYJxEVmAQ2vA0HHbtHxrr3gQXU4RwScVjTjYwcDwGuXvcifknJB4CbBCFMN0+05LHZ6JCWOjXQcVaYUr4PS0bdDiJMBri885psxRJeVUVq7hzG5hFpyQbjYO2gXpFqgmRisAn7umoUOHGQM0GuCiAZnv0isxN2OdjmvQl07+cOieBCDFuqBbpCg3o8ApkQRDXHxaBWL2tAsxTk3kyxb12ZmoZdQwysTCapZ6krCY+kZg84sdCnhQeUi+pAIdGVSHduaLlle4n61CxU7HWwSZCOKV7QYoGcRa6SyS7Md08spaYHFy+gWhpCUoA8Q2ETF7OzipIi0S+9UQe5qO9Efd26KLv2Pds32gZjV4docHQ8HBqG8z8fzlDa+7eGf/gj5/Q+DJtZ1R9tZJrJYTK9M1FeG2bQJT0laBbpdmQNyMcGaKdmivjU8i6ToPHO1bQu0xbAXwCyUlmcfZ17iJl8C9/IICorjajuzVKs1hSw0eeqDUT+tSCDYFSCJlhBLt0aI+gFrcz/k+3O6oZdAxSp0aRFv6jN2MicaM+dBwgDh7DEqs41VbGeBi2YmBjDVuhNGAR+I9d5aY5Rq/dZH1toSdzrCjQwxeEhGcwjFZoiQkGNJb+yy8ZKhRwnauZHbDajEa+AB7EvgYgr+2VGtc0x3LvT0eXxoMlwsQmfVq4HQqKhsah81Nt4kdSgpBZKaCyotK5aWku+CmVPo2yjvebzuFWdDL76UKBGxCluM+aiyxHhDTRsDvCqNU7TBIBLqmTUWgqFlo+Mljw8CRb5IdxZqrNTFG2MM6mS0Vv6w6BF/GKyicVEJXGsDPFwEWUDiE15btrUGszDv9rFYXEyqjynVewNdukgTzsBNJNPh988/kutOYf5ODaw/ff+ji20/fN5rvv15aYFPYVt9DM/dxy6N27TvyrAKD2n78djdpmHX3wofF5L0fi4Ki/eLxeJ51ce86tO2CunnuC6bukvb6fOe264+tbPi+TgbKfbK2j46Wwg+G0uwXD9/GbAE6v/Zqd0x6uI2b/q8rm6ft9zGdVmGVXJbmD6tF1/P9m1HMz5voO2ApaF96vrwkFeH2696337V+y48d3ffXuouOuY0uavbw/eYqVvr033ax/fPa75J+HqitrI0x/5mqAbUR7gFzmdkPXzK+r7pPt7fn5o4veUTQRLmM4mX57NFJMTJ7WK8tO/H+enuNRp339C4YxvvwjIc6+pZ4fuX33f8TK8fBu76uqQ//+zj34ua5P/x/BJSWp/T5HNSl2Feddwn7t+5d30ali/hefcv3LvsGN1FbXr+fvxct0Xa/jjFfT0hDrlP3Lufax2Ht3Hb3zVp+e7mq3ZXgf9l/f6f6fH7X+X9V76vu9x2WUrplcG/94HdP91HeXUfhV1206U9d5seLzXX5E36FOb0pquPbZz+/Huemz9zdtpzfZZy3dD1aclldddXYZne3VwH4p5yXdrffh3nfvkuTP7bGGqlh7zr03ayNq+6PqzilDvnfcZZG3B3c3/s2ntaxyGdTgnPHfc6tLhD2t9eh25PIT2m3P9i8fR1KE+4X/72Vv5imfM37u8c+cLdtty7O3vaZ/dtXh3ecf96Vfxluvr8fPDn53R1R7q6uvm6/a2V7/6Twri/cxOabcndPv1nFfjv4nA1bWg9TO5+jlRuteTitO3zpzwO+/TuJgq7VJ5xtwl3y/31r3/lfvnbd9+T/cb9K/fL314m9N9eRPl3p3zNA390xqsPGX56wrOgPzqnSIf/C96mVdLUedXfHlvKqPtGMfrtJ1T/aWfwh/x+VftfE/rl1LvfW31l7DdA38COgcOwe8Htnxz+/4fMmmJ/th1oLdfap/skPd1XpzIVKuHGdpaOdu0bTmF7T/Pox97hOWkfG67r6zY8pFxdfePE3U3+xP0Td2jThvn0q7jfuPumreP7sj5WffcXRqPqhuP+zGlVd2xTTlNsLu+4pyOlAyv1VRr3acI95W3X391w3FPdcs7W0Cwur7i/8Xd3Es//9hcuqaeqmD9xXR/23C8v7Pp2BvsXtWl4bfGe8ut33jRNG0644bikrtKbSZVVlsYFk+Xp9vSF+nNJyjsupG0aJgNXhknK1JlsvDx1n/Pqqf69Y8viqbu7PHWv5m8mFabzjLD4lhm+oTsZknJJ3qZxX7cDO6rMuy6vDuzgskjylrt9je1V3DJJuL6+9lVPXR9GXFgl3AQ425nGWc29++VvL3T57bWHmKpJ+hQead9xPMe/4/7O9WnK3YYvhDIdmMjXRk0KWCnLkbb2kFfHy7Vfu/QdO7tNGVPSuK64W+vEfaXWdRvj0gu0m7Sd7K2raWuc1We2i/v8PVIffxj5CSg4bfMnlrXC5y7jmbF5x53bvA8jmt5wXF8f4+zV7vu7pq1POVMjrw6fY0YNZsgUy3+48Cn/b1Oklgk5dv0/Unpfc5S1KRUL6pCr6uqWdSpJ2CZcU7f9Fcq842jadRzNi5QObFOU3vyZ6+KwqtJkIl7T1lGa3N38mXOgCv9HmYVDklb/8yPnplyVskVxzEQwbrR5zMp9x85kXqrSnvXBHE1PKeXCnuvqksmfysW/cNGx584pi9x/7rksPKVc3nNtfsh6rqrPdzffgmSi7ZVXyfP/P6Sz27DJ77o6LtL+Lrm/YYT/r2+rT2nb5kl6F9fVEys1U049Usr99a+cBvWbf7enpf9x8zCBa/dtGpafXr8tPryXb9jif3S+SZiWdXXbprQOE+auxzZtwvbHtPHPDMiy7lPueoHgurQ95XHaTb646tm97KnLsCu+Sbnu+Tfh7nnXi3VpxWKEu72t6vO39dejnrc9o/BHe34C3A9Bcnv7p5v/HQAA///qZ0sOmDQAAA==" -> "H4sIAAAAAAAA/9R6eW/cSJbn/wL6O3DcBcwuaiTxyKSd7vZgkkkyLzFCPCJ4zA4MXkoyGDxMMg+yu777IpiyR7JdqpndBRZtgKhiHC/e+73fO0LJVV31adXfOkOTfuTKI+3zJmz7+zK/pMlfuKg+VknYDp/eGVtDUyAC6tLy392wt1uctl1eVx854Y7/082fbm5vXy76081X2WreNXWX99PasO/DOCvTqv8L95TTtArL9NO7vMr7u/jp8O4/dzltWHVPaXurVXGd5NXhI/c+yvsXCyaV+/TS38e0Pia3cV095Yc/3Rh5mf6g3J9frrm5OXZp23284bhbjmnwkUtj8ZYN3nAcx3Vd9jk89lnd5mOafC7SYVrL/t1y77ouu227kFsul0tFAmO4EoZY1NirujSXynK5XC3N1YU86dstXT+tqkUe081Quq2mtA4S6YPcF/baEdLmfbJ6HM8C8WW3ykz66BlN+tjm4AI8uv4Qu3Bxb+mNkvDjQj+D4dfi6ZAtno4D8GeL7a9GKMPBwcphnoFavzxZ3nqeb/r43jZpFWl6vm/sYkbzpp6ZQa/05WH55VDYS1kds+EQyce5scgvzvYycxVytA1+7ZkjIE36NOTu8ddua/2aiag1i/1SOR63vhm1hP6qZ7gMH07taXCgeOxgf6p8hWTR43mA70X3kYTNPrlfZE745VETzvogI12svHj2eDjzh9yM5C6PdGd8D5z04kpzc/HhS2NC1/D3cXMIWmqHm80+sI2sH+F7Iwla+KAjr7aFZbocZoesj0ELFYdGc/v0+F4aR/6LYulivIIzyJ+b+fn85TE7ncWqj6TGeXjsk7Tf/YrnvPlYNZU32HYVNOKon+NUFCLvIr+vsgWtsoc2OJD0fVyb1eNSv9zHVJI1ezcc8uNjrJx/LYQP/pH6hoe+hEpfnHcPhUXUhjiemM6NnSDX6vtut4ln9+68GJ4eTonR4Sz5Iqy8zRpj2Iz1IeIXc+znvOXpTRVY90KKD6t761cXD73/5H/g2ycM42RZi+vgqdrNR99C3m63MIIirC4XSXuPYF5oO7DoEBF5fpRXw8Bvn7ZfnGgnKPOn90+JFMZW+zBTYx8l+vZeUAbgyrpA3sdBvlzD3R5Eo6fzjtQ/fbjwqWB++sSVIanbf2vTJAv7u7gu373me5qI87mwmDi/unKeBupWAI42Z2PbR0UgOp01su4o+WXjyGdYyN6HitwH79P6EZjavcGf97MP8z1XR8ckzF8ddnNu8z79zDLCc1g2YZ995O77srmG92eWIz6fwrabNIuvWeAj9/dnRaGtoO2D+nkFDWPrfPogxeHTB55P5+JcnEUzYfb0/mkePc3DlE+keCGI8YeFsBCfd6+g8Qhtzfq6fRGJyVyez2fz93NRkj68nwmRlIphGj59eC/J71NRCj+Iyez7w5efV5rlfHqw+f7BFlYWSnZOrqgW3iEbBTuT15E1zfH9qhB2NrI0rAHVdAMv4HXJRjsl4ClGKjAN0R8BVtaomAuRGPBpacwdtRCtdYYi0VIS3rJc1DxEQrMLNwFxCt2y0HlvUl1J+OCLhTEwC7oxHR1bSJcS/pIb/LwJ9KSLhUYFXkAiF0j2OiNOIXwxveQRa1h2sBWkSNCwA7xwDaDjNUpybtjc7NVcoXsO3lkJjysXWS7CumZpOp+UxmATPcNS1jprfp7iRjZ5oCCeSpauB3bRn9yC1kkJ4GrSebdCSNcCMdGRpmvTWnehsnez0IFZKa2Ldd/GwPDH7MF1G4AwrdJKsSACiiHsHowy2VqqcvE9fUzIYe/jHcGFIQJqzIMiu1gIXUJ0wa72QTLUnZUSPIZiUxtSc3E2dINIJiHqnx5EsDPc7SUmCk5x4/j8JTSEWMK4GcxzzQPVKn2pHh2PziIdyFjAARKUyizoQ7hOFLjR+5g2tuEuSt+1hnSDbWfVj1ERaLbbzwwpbv1R3wcYH40SdIaeNCuKeVfdbSwhUC2aAEfUT0Fhta6OVavCD/Ym2SM3WTsba7Q1ELouKBOauLbehKCYzRI+ORtUD11nO/fHTIg85YuBl3ukBZ2rGbNgrYeOJmSuTnPLUYDtWa6hga1dKZLF07Nf0WOEKYpW/WhVWIxU64TXwpBu6lPqZXKsWSIuhMe40HeR2cwisZNiinu8wYW1xjoSditHTBQD9YKPBBtvcGZ7ihWNuyKSgst+XF6s0h9NNBswAkrCY8V0dYg1YW15yRZhqq1oYBvaYmVSqltFLQVO4BtScQ7Wiy62F3ufBo1f0CYRrSMSli0ohBXUEsXAuLC9xHKRsPKRvrZJQgE9jKmjFJF43v/OXuXrXstLdDNfSAgFwETCynT92c/j6vKNo+ahUayqEYFIqc3H80hvHuJiOziuEIaafrE1aqTuJXMk6sZOLFkjXTl4h6wKnN0K8cZmK1mCJfm8VSflQbAQONm6nq/KS5s4ig/Qwg94S3Q3YBWvF2t7sxMNrX+03YsDBLw3PP8M1t3JprRyN3EbrRuEN8YJes05IpmNy0sfb9DJ4oVHx0F75O42aNXDkOAwHnFp8YEXajPJcbYCcnsM1d0+2mTULvQOednWFC8qWuMZKgDwHX0OvKWE1/MKqsqDTRM+xYoJzYZHYgLMaikBjO3A/cADhGZIawa7Wo7hhp6AvptBvLMssR9SF9i2l5RmkYmhlAG7DI6xaEiuvRCBSwWLZH2qCfKKAN4v6vmeb+YW0gV7U1/8IhFiBPy9pO8RtlCyWljR6A9JkXg+KuZICB58asx8nBnmuIOg0kno7i4xQbOAWJpdmHu7Ap1jf5DiDZjHRD8Bz+L9YncEtBBMz1is8mtOttBc22pAR9TaWQVVTWzp11zO73+oFCzRmyIekjUtQxdkyRrJq3x52K4UzfesDB7qw3a1vD56QOMKNJE4k7eqcdiryszIi/23+ZXiBN6u8d3zwalw75d4eLX/+oiGWs+gU8/8sT4bY0OB05RgbAow1jxUm8If64sx1kKg1qPv1Gef1HMwvTdF4DRZ4NQXQOoLdJocvNIPNIE4z5INHgJbUaJ1copLyodrXt5uQO07WwHQpEnWmY14XY9KMKSewofu4ni1+frYHhgTFw8wV1SHCKdY3AmheykeysUQnF/hkUVrWoSeNX+5f3q0+SlZKavADU5xieSt1mRRvrwY7FHrATj1AFfLwVC3l62WALz8HicFRpJ5MN2AD7ztAebK3ndnB8NZskc2CJINcjgYZDkatrJxsPnKD4m7+xK4gIe5QiNXbyJNL4LNjsaSsYgkkCcu7YI1HmJeGQLXqn3PPPrion9pB5JwHpaYJCvFTNxdF7rGwRbxfKvRY1B+kH+wWVcEv7w0/qA8BF5xMN1LFUk7hncPc2WIxd/H/IXuNuK1A9rgPFpT8oB6mjr1Ya9uz0A9HPyS8nvzB05Nj+MuisS9CPFY7382//ycDbUpAWmKQG0I8wV0mgw4rDDWc6jWgkFqHpCaXSIodBpikJr5bDTIW3IVCgiTW88n/5KaD9SmDJxaMpx69Mda9EmTA6ceGecDh8mvBd9pSOC8qe88YHpNcprcd+rBH2uJxYpBapHtN9T6wvR+lsVi6zzp/bbcIVBrEYy1ZKgNYXIDhsHY5GwMqE3pM1yYHaQpDbXmfVKLhlMLb8tVSt+Z9BEDdYpThsUA2RmkHpl+wYQP06/JmZ6+M8U5H6hv6stk8YbTlMbIimtTGqQpmJ5sDKj14BOWG1iOqOe+01DmZ5ZP/sBvmT8yGfUIHaZzU/rjlJtEoE74Up/UM2Oc7JB85+rTgEw4v6UvP+WnkfGpocZYXwLmnyvnzkzvgNQCvOI6GM6UE4TAqc/gbf5KjJv+ONl1hiqT3ZQ+mXh2eZYxNxzm2yZjvGE8Cxif35SrUEOtxedYmAVqkwG1oWCsZ8EVm3lAGP8a6o+TLNFgfCbMrrdxuObwhjK9GY7M38E1vph+M/Cc54FaC4DUM2YDIBP+b8mdOGNMWNQXhkdAmsyYzpl8yDPbfcYZNs7WOvWZxdIfyJ3wYnhClfFzsk8yrjF4Zv6Baj1jXDamuYkPI1CbzH/bb3zgsBitB4OwWJi4MYMqe5/OmrCGjNfMpwwXFnekvvyB30o48ZTlrib3R8b7emQ5iPF44t3EjWuMTzHD+Mbi4u04zsE17odJF/XqP0Dqs+E0mTHltqZgseiTqWafWXwY6h/lh+UI1SlHzlgc+CxfqdceAKrMjxOPzxPfnFqA1/rPclQWvBnHS5b/cnD+eW2wvOwciXMaVaa8VX0BOIa0XR3OqaqdDXV5eVVT9INgqFQ0BoWmG4tGU88zH3/sZRQfOMt5QoyDWeojq4+muDjGkjX4Lj0mG0PersEQelbji3r3O/VONZ1mbaKLY/1Q1/5T/otaPNVW22V6WU1QUhqT+vBz2UsRqI1iTfm4WVtOo1lOszKcRmOcs9RGZ3WDjZtOs4LX2rRi/AFMJ6cWLdLoFmkUw2lU6y37PcyH6wWzdb7Veprayi5Y4+O1r2S91PLnvlv3NHVpAQnVYWHpsEBzSBINFv4AC/MCC0uBZCvAQl9NYwSvIEEiJFsRFsYMkmwFyVKCxJcgMWewCNaw2Cm/g7UWejvouwKF+eLt3u7FE4t4CF29gwSsIYlHWLCzkjUkiQ6JtYZEEyDRRkgCHRbaBRbBalo3rTUHWAQaLNAMEqYvGq9rzPPqDTynPkvHo+8mFOYKmfpYF2TRD33iM7/XtAo9K4tWihO6ydH3LCEuUffsC9Z3NfE6o3EpsBj4wReuis7Q88ethmfJGh+DNS6e9+JY1KvA+T2OKcjRjQMWcb7VAY2rgMa5oiSeVQfunL/eKegpesPWF9xWoo1F43LO9oiBrTz76ne4o1kQjQ2JROEcSYDG+fy1P4fzwdLmDqwAz3B8KMEp8pQT8+dDuRj9CjfR2jxG0q56WCmaQw3Z95LxrXXPd6OXGH/f547hWhuAE3ihZ9WIAsVy5ySu6PlHHJQMTrFWzw12FyJTHSNTb3Pt4ViNYHXw8rWPZHmX9QusTk99jzP1lK/w8UVDhuutHBBNBuNSBiKSA2cpB64mByWSwXorG04hG6SQA1WTfQfJgerLfqnJhnqQgzWSoWO+7u/XmEJyYPwdYLnLYBkQSJQSksMckiWLywKS4nxdg0tY7gpI/BkscQZLNEDC1sff3QcVVoPmrHZMdz3WH7K6xWxSWa809TJT/WZ9Irj2DvOA1Qu1HgLWj5Kpv3llP3QNOSCmDBxD9kdT9p3DhIVR+nLgItkYmZ1I9kUkQ/buaDJUkWyoseyP8TQWkOVr+9UlD0lWwNLgYamXsDR5SDQRluYMku0IiVLAEvGw9C+QbGeQxCIkhxESjYfEF6d9xLx8V0PmrPcM1Oney/qHcbr/OtM76ztZTSdgqtlNdq3ftcjuxj6pzwG7a4xNDr/rZwwHyYD4MnQMGTAcJhuZXczvpgzGreyLzOatDJxYBirjykH2HV/2J9yY/f53/tcJLPUcEn8+5TBSzCHZlbBEZ1hqZ0h8HpIts3WE5CDAUhsgQRdIrBKS5WyaLzXhe/8DtcmNa596mXpl9k5Y7Z9wkIzr3wJ44zkGWI/H8Jp4oU59JetrXvPfiWVjXMoGs09EsuGassG4vWZ35lj2iS8HpTbhYLBYUc2J72BkvClkUDKObL/z/0GEJCGQ6DksLQpJzEOiU1gaIyTGGRKQw9IXr3UgHiDZDpAwzmwFSBQCCaXT3tf+Z/cYFsfEGKd+SJj44EwxPwNjUzzfR4XpfspigNk9NvnU309jrGd/bT+L8aD0ZbA25UA1ZaAak20Gi4MSyT7ZykbJxrXJ9yxfBOpy4gdwtnLg/Cz+QQZJPL9yenn++scms8AbG80OJo9trNG1jYCCNTTNPZgNsBHVUrdRTV4fbDFREp6uTDfZYUx3ERKUvXAYDUf54vPoYqiBClyrMCSNx3ySu16iIUz3trgIbTcTfX6uIISNVbGzTC9ZhwXGDtrtLF67YISVREoMnwAYupYXbUBojlj0RYEkfFb7/ByEBZYcbOkpEpDpUYi1gsfi9MOBbHnxns0l/Mu5RomQ4CAv2QXCd3q4/coqM/flDwUuzfYp1bd2eQktMasDzRDCA+OzIgVioodIUAwtUZGkbxBPc4O3LAvtFISxYjrWziwsyfSSKuDxg+kudmahW5a6HX1eP8c6dlyMW9fZij5PrVUhCD7ZtabQwAdxrsO1JmGvlkLaZGm1HNwS5JEECkNrLgm/q32vOYV8I6FRP/q8cErwVgrUZRvjxoQa5kMdl5FQ7H26CyLUg3jovyBxt0pccALUst1iOzPGZG5gZWtonQhE3CfI5I2NLqfawjPG7Isl7C6AWCBysQjsRYNdfsQeBoHZyD6v6w+jXjsadXCJV4ZQzIx18iXMu9HCgR9rwTHGWRgUs9aslLPr7FrgmDxwZ1JcAWgU3WCv+5Oj4i+Op5tpqZ9XZaZFPHYjIfDcwjqbgrJKy+CUuNsZEjLeFBfYQvPO1ps8QJc2cME+5Beq7YGZvfF5Y7PTgavvYgmNIQJ7oCI+quI90GmeIv8UbvTe2TSVg8Dc0g6jrfW7RKeVsd7lCU8DvBZgwCfVg2RBMALFrRKM19QKeP1iO7gMRECQK1As6HxybgbD00bTTYBZ6IolNlVAMikQAynhLWX68YkoyMT69oHfKbaXKJamF2aZQFxkFtDwOhB07BYd79oLHlSHc0TAaUUzPnYwALx22Yv8KSkXBG4SjDDVMN2ew2KnR1Li2EjHUWVK8TooHX07hDgZ4PrCY74ZQ3RZGaW1exiTS6glF4SLvYN2QaoFmonBKuDnrlnowEHGAL0miGhw9ovEStztaJfzKtS1kz8sigcxaKEe6AYJ6v0IYEoU0RAXj1axqA3NUpxzM8mydW1mFnoJNbwykaCapa4kPJaeMejMQpcSHlQuog+JQFcm1bGt6ZLlJe5Xu1Cx08EmQTaieEWLAXoWsUYquzTbMb2ckhZYvIxuYQhJCfoAgU1UzM4uTopIu/ROFeSuthP9ceem6NL/aNdsH4hZHa7N0fFwYBDK+3w8T2nj2x7+6Y+Q3/8waGJdd7SdZSKLxfTKRH1lmE2b8JSkVaDblTkgFxOsmZIt6lvDs0iKzjNX27ZAWwx7AcxCaXn2ceYlbvIlcC+PoKA4rrYzS7VaU8hCk6c+GPXTigSCXQGSaAmxdGuEqB+wNvdDvj+nG3oJVKxClxbxpj5jJ3OiMXMeJAwQzh6jMttYxXYWuGhmYgBTrTthFPCBWO+tNUap1m99ZK0tcacj3MgQg4dkNIdQbIYICTmW9MYuGy8ZepSgnRu53YBKvAYewL4ELqbgnx3VOsd050JPn8eHJsPFInRWvRoIjYrKpvZRY+NNUoeSUiCpuaDSsmJpKfkumDmFvo3ynsfrXnE29OJLiRIRq7DFmI8qS4w31LQxwKvSOEUbDCKhnlljIRhaNjpe8vggUOSLdGehxkpdvDHGoE5Ga+UPix7xh8EqGheVwLU2wMNFkAUkPuG1ZVtrMAvzbh+LxcWk+phSvTfQpYs04QzcRDIdfv/8I7nuFObv1MD60/c/utj2w+e95tuflxb4FLbVx/DcfezSuE37rgyr8JC2H4/dbRp2/a3wcSFJ7+eisHi/WCyeV33Mqz5tq5B+juuyqbu0nT7vue3qUzsrno+zkWKvrO2js4Xgs7EEy/XzlwFLoP6fndodoy5u86bP6+r2ecttXJdlWCW3henTevH1bN92NOPzBtoOWBrap64PD3l1uP2q9+1Xve/Cc3f37aXuomNOk7u6PXyPmbq1Pt2nfXz/vOabhK8naitLc+xvhmpAfYRb4HxG1sOnrO+b7uP9/amJ01s+ESRhPpN4eT5bREKc3C7GS/t+nJ/uXqNx9w2NO7bxLizDsa6eFb5/+X3Hz/T6YeCur0v6888+/r2oSf4fzy8hpfU5TT4ndRnmVcd94v6de9enYfkSnnf/wr3LjtFd1Kbn78fPdVuk7Y9T3NcT4pD7xL37udZxeBu3/V2Tlu9uvmp3Ffjf1u//mR6//1Xef+f7usttl6WUXhn8ex/Y/dN9lFf3UdhlN13ac7fp8VJzTd6kT2FOb7r62Mbpz7/nufkzZ6c912cp1w1dn5ZcVnd9FZbp3c3X/4t7ynVpf/v1nfvlu0D5hzHVSg9516ftZG9edX1YxSl3zvuMszbg7ub+2LX3tI5DOp0SnjvudXBxh7S/vQ7dnkJ6TLn/xSLq61CecL/87a0MxnLnb9zfOfKFu225d3f2tM/u27w6vOP+9ar4y4T1+fngz88J6450dXXzdftbK9/9F4Vxf+cmNNuSu336ryrwj+JwNW1oPUzufo5VbrXk4rTt86c8Dvv07iYKu1SecbcJd8v99a9/5X7523dflP3G/Sv3y99epvTfXsT5d6d8zQR/dMarTxl+esKzoD86p0iH/wveplXS1HnV3x5byqj7Rjn67SdU/2lv8If8flX9XxP65dS731t9Zew3QN/AjoHDsHvB7Z8c/v+HzJpif7YdaC3X2qf7JD3dV6cyFSrhxnaWjnbtHE5he0/z6Mfu4TltHxuu6+s2PKRcXX3jxN1N/sT9E3do04b59Ku437j7pq3j+7I+Vn33F0aj6obj/sxpVXdsU05TbC7vuKcjpQMr9lUa92nCPeVt19/dcNxT3XLO1tAsLq+4v/F3dxLP//YXLqmnupg/cV0f9twvL+z6dgb7F7VpeG3ynvLrl940TRtOuOG4pK7Sm0mVVZbGBZPl6fb0jfpzUco7LqRtGiYDV4ZJytSZbLw8dZ/z6qn+vWPL4qm7uzx1r+ZvJhWm84yw+JYZvqE7GZJySd6mcV+3AzuqzLsurw7s4LJI8pa7fY3tVdwySbi+vnZWT10fRlxYJdwEONuZxlnNvfvlby90+e21h5iqSfoUHmnfcTzHv+P+zvVpyt2GL4QyHZjI10ZNClgpy5G29pBXx8u1Y7v0HTu7TRlT0riuuFvrxH2l1nUb49ILtJu0neytq2lrnNVntov7/D1SH38Y+QkoOG3zJ5a1wuc+45mxeced27wPI5recFxfH+Ps1e77u6atTzlTI68On2NGDWbIFMt/uPAp/4cpUsuEHLv+P1N6X3OUtSkVC+qQq+rqlnUqSdgmXFO3/RXKvONo2nUczYuUDmxTlN78mevisKrSZCJe09ZRmtzd/JlzoAr/R5mFQ5JW//Mj56ZclbJFccxEMG60eczKfcfOZF6q0p51whxNTynlwp7r6pLJn8rFv3DRsefOKYvcf+65LDylXN5zbX7Ieq6qz3c334Jkou2VV8nzf39IZ7dhk991dVyk/V1yf8MI/9/fVp/Sts2T9C6uqydWaqaceqSU++tfOQ3qN/9uT0v/4+ZhAtfu2zQsP71+W3x4L9+wxdcjWeebhGlZV7dtSuswYe56bNMmbH9MG//MgCzrPuWuVwiuS9tTHqfd5Iurnt3dC8ll2BXfpFz3/Jtw97zrxbq0YjHC3d5W9fnb+utRz9ueUfijPT8B7ocgub39083/DgAA//9HdjH+mjQAAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-01eed7cdc78e89c7f" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 7 -> (known after apply)
        id                      = "lt-04e6df10bd74694e7"
      ~ latest_version          = 7 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTcyLjMxLjY0LjExCk9TQlVJTERfQ0FfQ0VSVD1MUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VSRVZFTkRRV1pYWjBGM1NVSkJaMGxWVUROUU0yWXpOVkJHVWs1MWIyWjBlbU01VERrMlJHaFViMlJCZDBSUldVcExiMXBKYUhaalRrRlJSVXdLUWxGQmQwWnFSVlZOUWtsSFFURlZSVUYzZDB4aU0wNXBaRmRzYzFwRE5YWmpiV04zU0doalRrMXFRWGRQVkVWNlRWUlplVTFFVlROWGFHTk9UWHBCZHdwUFZFVjRUVlJaZVUxRVZUTlhha0ZYVFZKUmQwVm5XVVJXVVZGRVJFRjBkbU15U2pGaFYzaHJURzA1ZVZwNlEwTkJVMGwzUkZGWlNrdHZXa2xvZG1OT0NrRlJSVUpDVVVGRVoyZEZVRUZFUTBOQlVXOURaMmRGUWtGTlFuQnJXVkZZU1ZOTVl6aExXV3BOVVZsbmVuQlJPVU5CTTFKTE1tZElSREJ4WVhGemRqZ0tZVkpqVmtNMk5sTTVaa2h4UlVVeGFVeFZXRTgzTURKUmVqVnphMnBvTTNweFRIbEhVamgzVWxZdkwyTkpNV0l4Y2pCVmVWcFRZMHhhTTFjM1ZWcHlRd28wTkRSbVkzb3pUWGw0YkZONlYxVlpVMUJuUWtsTGFHZEJPSEZ0Y2xwU01XOW1ZV1J5ZUhWU1RDdHpia1pFU1d0NE0zY3JZekZLWlZWdU1tTnNNRmRwQ2xWMFdESkhSMVpEUmxkTlQyRnZaa1JyV0ZWRFJuVkxTSGRLVVdkR1RIUnpTRU5hV1dObWRsZFdTRnBhTms0NGQwZHdNbEZhV1RJNVl6aDFiWEJxTVZBS1VFWnNXRU00WkdGYVRFMWhXRmxpUlRCTlNYUldNRU5JU25CM1IwbHdZbmx1YlZsVWJDdHpSblYyYkRSdlZHMXllSG92ZVhoNmNFUjJWazFQY2tGSmJRcDRiMnMzY2xWdFZIVmtSR1ZGVTFKQ1QyZEJNVXQxWVUxU1ZIVmhTWEJSYnpKa2IzWnhLekF4Um1ZelFVNHlWVU5CZDBWQlFXRk9WRTFHUlhkSVVWbEVDbFpTTUU5Q1FsbEZSa28zWlRaWU0za3daRzlzY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFDT0VkQk1WVmtTWGRSV1UxQ1lVRkdTamRsTmxnemVUQmtiMndLY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFCT0VkQk1WVmtSWGRGUWk5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWdwQlJucDJOMmxsUzBjNWJGcExja0l5VFcxYWFFRnhTRWxNZVd4aFQzbFdjVGMzUnpsQ1RWSlVSbk53V25VME1ISTNSMVIzWTBSb2RtZzFSVU52U0ZGaUNteHJkVEJZTlU5WVowUjJXSE5DY0c5R1NISjJNRXRQU1d4VE4xVktNWFl3TkdzdlNsbG5XSGNyYkdwVVZITXZPWHB3YmpoU1ZteHRjSFV2UjAxUFRUVUtVV0pIVUN0T2FqVmFjelZtUjBaWGFFNDNUVEkxVVd0Vk9ESktiSGhsU2tGc1VYaElRMnhEVUdWNFVrTk5ZVEY1TlhBM1ZHNW5PREJMU2xkMGVWQlFPUXAwVTJkTlFuQTNOVlZTWlc4ME5VVTRVRXB5U25BemFIbHZORko0T1ZKUlIydHllV05TU1hkbVFraDJhM2hOU21adWMyTTNXUzkyTldsMVJqaHRlRTE2Q2pOMFlrbzVLMHA1UlVGMVNIb3hZa2QxY1VOWUszRktVVlJVZEM5UmJ6WXlka2RYWVVrNVUxWkxZbE00WVZoTVF6Sk9ObkZqYVdKeGNqVTRaalJFU2tRS1NuTnNUUzgzY0hONWNqRnZOWFIwWWtKdU5sazFRWE05Q2kwdExTMHRSVTVFSUVORlVsUkpSa2xEUVZSRkxTMHRMUzBLCldPUktFUl9TU0xfS0VZU19BUk49YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy1lYXN0LTE6OTMzNzUyMTk3OTk5OnNlY3JldDpicmV3X2tleXMtN0ZVZWVsCgojIFZhcmlhYmxlcyBmb3IgdGhlIHNjcmlwdC4KQ09NUE9TRVJfRElSPS9ldGMvb3NidWlsZC1jb21wb3NlcgoKIyBBZGQgbWhheWRlbidzIFNTSCBrZXkgdGVtcG9yYXJpbHkuCmN1cmwgaHR0cHM6Ly9naXRodWIuY29tL21ham9yLmtleXMgPj4gL2hvbWUvZWMyLXVzZXIvLnNzaC9hdXRob3JpemVkX2tleXMKCiMgU2V0IHVwIC9ldGMvaG9zdHMKIyBUT0RPKG1oYXlkZW4pOiBXZSBuZWVkIHRvIGNvbnZlcnQgdGhpcyB0byBETlMgbGF0ZXIgd2hlbiB3ZSBsYXVuY2guCmNhdCA8PDwgIiR7Q09NUE9TRVJfQUREUkVTU30gJHtDT01QT1NFUl9IT1NUfSIgPj4gL2V0Yy9ob3N0cwoKIyBEZXBsb3kgdGhlIGNvbXBvc2VyIENBIGNlcnRpZmljYXRlLgpta2RpciAke0NPTVBPU0VSX0RJUn0KYmFzZTY0IC1kIC0gPDw8ICR7T1NCVUlMRF9DQV9DRVJUfSA+ICR7Q09NUE9TRVJfRElSfS9jYS1jcnQucGVtCgojIERlcGxveSB0aGUgY29tcG9zZXIga2V5IGFuZCBjZXJ0aWZpY2F0ZS4KL3Vzci9sb2NhbC9iaW4vYXdzIHNlY3JldHNtYW5hZ2VyIGdldC1zZWNyZXQtdmFsdWUgXAogIC0tc2VjcmV0LWlkICR7V09SS0VSX1NTTF9LRVlTX0FSTn0gfCBqcSAtciAiLlNlY3JldFN0cmluZyIgPiAvdG1wL3dvcmtlcl9rZXlzLmpzb24KanEgLXIgIi53b3JrZXJfa2V5IiAvdG1wL3dvcmtlcl9rZXlzLmpzb24gfCBiYXNlNjQgLWQgLSA+ICR7Q09NUE9TRVJfRElSfS93b3JrZXIta2V5LnBlbQpqcSAtciAiLndvcmtlcl9jcnQiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1jcnQucGVtCnJtIC1mIC90bXAvd29ya2VyX2tleXMuanNvbgoKIyBQcmVwYXJlIG9zYnVpbGQtY29tcG9zZXIncyByZW1vdGUgd29ya2VyIHNlcnZpY2VzIGFuZCBzb2NrZXRzLgpzeXN0ZW1jdGwgZW5hYmxlIC0tbm93IG9zYnVpbGQtcmVtb3RlLXdvcmtlckAke0NPTVBPU0VSX0hPU1R9Ojg3MDAKCg==" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 8 -> (known after apply)
        id                      = "lt-0aae9d85fdd3f7067"
      ~ latest_version          = 8 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTAuMzAuMTguMTEKT1NCVUlMRF9DQV9DRVJUPUxTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVVJFVkVORFFXWlhaMEYzU1VKQlowbFZVRE5RTTJZek5WQkdVazUxYjJaMGVtTTVURGsyUkdoVWIyUkJkMFJSV1VwTGIxcEphSFpqVGtGUlJVd0tRbEZCZDBacVJWVk5Ra2xIUVRGVlJVRjNkMHhpTTA1cFpGZHNjMXBETlhaamJXTjNTR2hqVGsxcVFYZFBWRVY2VFZSWmVVMUVWVE5YYUdOT1RYcEJkd3BQVkVWNFRWUlplVTFFVlROWGFrRlhUVkpSZDBWbldVUldVVkZFUkVGMGRtTXlTakZoVjNoclRHMDVlVnA2UTBOQlUwbDNSRkZaU2t0dldrbG9kbU5PQ2tGUlJVSkNVVUZFWjJkRlVFRkVRME5CVVc5RFoyZEZRa0ZOUW5CcldWRllTVk5NWXpoTFdXcE5VVmxuZW5CUk9VTkJNMUpMTW1kSVJEQnhZWEZ6ZGpnS1lWSmpWa00yTmxNNVpraHhSVVV4YVV4VldFODNNREpSZWpWemEycG9NM3B4VEhsSFVqaDNVbFl2TDJOSk1XSXhjakJWZVZwVFkweGFNMWMzVlZweVF3bzBORFJtWTNvelRYbDRiRk42VjFWWlUxQm5Ra2xMYUdkQk9IRnRjbHBTTVc5bVlXUnllSFZTVEN0emJrWkVTV3Q0TTNjcll6RktaVlZ1TW1Oc01GZHBDbFYwV0RKSFIxWkRSbGROVDJGdlprUnJXRlZEUm5WTFNIZEtVV2RHVEhSelNFTmFXV05tZGxkV1NGcGFOazQ0ZDBkd01sRmFXVEk1WXpoMWJYQnFNVkFLVUVac1dFTTRaR0ZhVEUxaFdGbGlSVEJOU1hSV01FTklTbkIzUjBsd1lubHViVmxVYkN0elJuVjJiRFJ2VkcxeWVIb3ZlWGg2Y0VSMlZrMVBja0ZKYlFwNGIyczNjbFZ0VkhWa1JHVkZVMUpDVDJkQk1VdDFZVTFTVkhWaFNYQlJiekprYjNaeEt6QXhSbVl6UVU0eVZVTkJkMFZCUVdGT1ZFMUdSWGRJVVZsRUNsWlNNRTlDUWxsRlJrbzNaVFpZTTNrd1pHOXNjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUNPRWRCTVZWa1NYZFJXVTFDWVVGR1NqZGxObGd6ZVRCa2Iyd0tjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUJPRWRCTVZWa1JYZEZRaTkzVVVaTlFVMUNRV1k0ZDBSUldVcExiMXBKYUhaalRrRlJSVXhDVVVGRVoyZEZRZ3BCUm5wMk4ybGxTMGM1YkZwTGNrSXlUVzFhYUVGeFNFbE1lV3hoVDNsV2NUYzNSemxDVFZKVVJuTndXblUwTUhJM1IxUjNZMFJvZG1nMVJVTnZTRkZpQ214cmRUQllOVTlZWjBSMldITkNjRzlHU0hKMk1FdFBTV3hUTjFWS01YWXdOR3N2U2xsbldIY3JiR3BVVkhNdk9YcHdiamhTVm14dGNIVXZSMDFQVFRVS1VXSkhVQ3RPYWpWYWN6Vm1SMFpYYUU0M1RUSTFVV3RWT0RKS2JIaGxTa0ZzVVhoSVEyeERVR1Y0VWtOTllURjVOWEEzVkc1bk9EQkxTbGQwZVZCUU9RcDBVMmROUW5BM05WVlNaVzgwTlVVNFVFcHlTbkF6YUhsdk5GSjRPVkpSUjJ0eWVXTlNTWGRtUWtoMmEzaE5TbVp1YzJNM1dTOTJOV2wxUmpodGVFMTZDak4wWWtvNUswcDVSVUYxU0hveFlrZDFjVU5ZSzNGS1VWUlVkQzlSYnpZeWRrZFhZVWs1VTFaTFlsTTRZVmhNUXpKT05uRmphV0p4Y2pVNFpqUkVTa1FLU25Oc1RTODNjSE41Y2pGdk5YUjBZa0p1TmxrMVFYTTlDaTB0TFMwdFJVNUVJRU5GVWxSSlJrbERRVlJGTFMwdExTMEsKV09SS0VSX1NTTF9LRVlTX0FSTj1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLWVhc3QtMTo5MzM3NTIxOTc5OTk6c2VjcmV0OmJyZXdfa2V5cy03RlVlZWwKCiMgVmFyaWFibGVzIGZvciB0aGUgc2NyaXB0LgpDT01QT1NFUl9ESVI9L2V0Yy9vc2J1aWxkLWNvbXBvc2VyCgojIEFkZCBtaGF5ZGVuJ3MgU1NIIGtleSB0ZW1wb3JhcmlseS4KY3VybCBodHRwczovL2dpdGh1Yi5jb20vbWFqb3Iua2V5cyA+PiAvaG9tZS9lYzItdXNlci8uc3NoL2F1dGhvcml6ZWRfa2V5cwoKIyBTZXQgdXAgL2V0Yy9ob3N0cwojIFRPRE8obWhheWRlbik6IFdlIG5lZWQgdG8gY29udmVydCB0aGlzIHRvIEROUyBsYXRlciB3aGVuIHdlIGxhdW5jaC4KY2F0IDw8PCAiJHtDT01QT1NFUl9BRERSRVNTfSAke0NPTVBPU0VSX0hPU1R9IiA+PiAvZXRjL2hvc3RzCgojIERlcGxveSB0aGUgY29tcG9zZXIgQ0EgY2VydGlmaWNhdGUuCm1rZGlyICR7Q09NUE9TRVJfRElSfQpiYXNlNjQgLWQgLSA8PDwgJHtPU0JVSUxEX0NBX0NFUlR9ID4gJHtDT01QT1NFUl9ESVJ9L2NhLWNydC5wZW0KCiMgRGVwbG95IHRoZSBjb21wb3NlciBrZXkgYW5kIGNlcnRpZmljYXRlLgovdXNyL2xvY2FsL2Jpbi9hd3Mgc2VjcmV0c21hbmFnZXIgZ2V0LXNlY3JldC12YWx1ZSBcCiAgLS1zZWNyZXQtaWQgJHtXT1JLRVJfU1NMX0tFWVNfQVJOfSB8IGpxIC1yICIuU2VjcmV0U3RyaW5nIiA+IC90bXAvd29ya2VyX2tleXMuanNvbgpqcSAtciAiLndvcmtlcl9rZXkiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1rZXkucGVtCmpxIC1yICIud29ya2VyX2NydCIgL3RtcC93b3JrZXJfa2V5cy5qc29uIHwgYmFzZTY0IC1kIC0gPiAke0NPTVBPU0VSX0RJUn0vd29ya2VyLWNydC5wZW0Kcm0gLWYgL3RtcC93b3JrZXJfa2V5cy5qc29uCgojIFByZXBhcmUgb3NidWlsZC1jb21wb3NlcidzIHJlbW90ZSB3b3JrZXIgc2VydmljZXMgYW5kIHNvY2tldHMuCnN5c3RlbWN0bCBlbmFibGUgLS1ub3cgb3NidWlsZC1yZW1vdGUtd29ya2VyQCR7Q09NUE9TRVJfSE9TVH06ODcwMAoK" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210118185335025300000004" -> (known after apply)
      ~ id                                  = "sfr-98ab7cff-5def-4b8e-a971-0137b925d3de" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-04e6df10bd74694e7" -> null
              - version = "7" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-04e6df10bd74694e7"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210118185314149200000002" -> (known after apply)
      ~ id                                  = "sfr-edc8a44d-a2fd-4176-8345-bca82384b54e" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0aae9d85fdd3f7067" -> null
              - version = "8" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0aae9d85fdd3f7067"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-2682721396" -> (known after apply)
      ~ instance_id = "i-00f4b887d697163a3" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-1013402795" -> (known after apply)
      ~ instance_id = "i-0bf72c3a328228c3d" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*